 
* Circumstellar nebula M1-67 around the Wolf Rayet star WR124

** Plan for poster
This is in a [[file:m1-67-bowshocks-poster.md][separate markdown file]] for greater accessibility

** Measuring the knots
- Region file
  - [[file:../../../Work/WR124-HST/m1-67-globules.reg]]
- Number of globules: 169
- Number of isolated globules where we can hope to measure the shell: 49
** JWST images
- [[https://mast.stsci.edu/portal/Mashup/Clients/Mast/Portal.html?searchQuery=%7B%22service%22%3A%22CAOMDB%22%2C%22inputText%22%3A%22wr124%22%2C%22paramsService%22%3A%22Mast.Caom.Cone%22%2C%22title%22%3A%22MAST%3A%20wr124%22%2C%22columns%22%3A%22*%22%2C%22caomVersion%22%3Anull%7D][Link to search of MIRI and NIRCAM images]]
*** Available filters and corresponding spectral features
**** NIRCAM
[[https://jwst-docs.stsci.edu/jwst-near-infrared-camera/nircam-instrumentation/nircam-filters][Documentation]]
- f090w
  - 0.795 - 1.005	
  - [S III] 9069 AA, 9533 AA
  - H I Paschen lines down to 0.9548590 H I 3-8 
- f150w
  - 1.331 - 1.668
  - He I 1.3415350934 1s.3p-1s.5s 1Po-1S
  - He I 1.508777481 1s.3s-1s.4p  1S-1Po
  - H I Brackett lines down to 1.6411674 H I 4-12
- f210m
  - 1.992 - 2.201
  - Br gamma H I 4-7 2.166120 micron
  - He I 2.058690463 1s.2s-1s.2p  1S-1Po
  - H_2 2.12 micron and others
- f335m
  - 3.177 - 3.537
  - PAH feature at 3.3 micron (typical width 0.04 micron)
    - Plus weaker feature at 3.4 micron
    - Plus broad pedestal 3.25 - 3.6
  - Pfund delta 3.296992 H I 5-9
  - Weak He I intercombination line
    - 3.36408868 He I] E1 1s.3s-1s.3p  3S-1Po  1 - 1  A=1.460e-01 
- f444w
  - 3.881 - 4.982 (W=1.101)
  - He I lines are all weak (n=5 or higher for upper levels)
  - [Mg IV] ground config fine structure line
    - 4.4867 [Mg IV] M1 2s2.2p5-2s2.2p5 2Po-2Po 3/2 - 1/2
  - Br alpha H I 4-5 4.052262 micron
  - Pfund beta H I 5-7 4.653778 micron
- f470n
  - 4.683 - 4.733 (W=0.05)
  - Pfund beta H I 5-7 4.653778 micron
  - H_2 4.695 micron
  - Unknown 4.673 micron
***** Strange behavior of the f470n filter
- Only the H_2 4.695 micron line is comfortably within the filter bandpass
- The H I lines are all too far outside the filter to contribute significantly
- This means that most of the emission must be continuum
  - That is exactly what is seen in Orion
  - Brightness of F470N and F480M are similar
  - Brightness is in MJy/sr, so that is per Hz


**** MIRI



*** Alignment of JWST images

**** Try and do a better job of alignment
- We can use the scripts that I wrote for multifrecuencia class
- 

***** The HST images
- In the notebook analysis, I used the Ha image from the second epoch
  - ~11137_01~
- But we want to align the wide band images too, which I suspect are only the first epoch
  - ~06787_01~

****** Copy the original HST images to working directory
And give them shorter file names that include the year
#+begin_src sh :dir data :results verbatim
  D=/Users/will/Work/WR124-HST/MAST_2023-04-03T1936/HLA/
  ID=06787
  for FN in f656n f675w f555w; do
      cp -av $D/hst_${ID}_01_wfpc2_${FN}_wf/hst_${ID}_01_wfpc2_${FN}_wf_drz.fits wr124-hst-1997-${FN}.fits
  done
  ID=11137
  for FN in f656n; do
      cp -av $D/hst_${ID}_01_wfpc2_${FN}_wf/hst_${ID}_01_wfpc2_${FN}_wf_drz.fits wr124-hst-2008-${FN}.fits
  done
#+end_src

#+RESULTS:
: /Users/will/Work/WR124-HST/MAST_2023-04-03T1936/HLA//hst_06787_01_wfpc2_f656n_wf/hst_06787_01_wfpc2_f656n_wf_drz.fits -> wr124-hst-1997-f656n.fits
: /Users/will/Work/WR124-HST/MAST_2023-04-03T1936/HLA//hst_06787_01_wfpc2_f675w_wf/hst_06787_01_wfpc2_f675w_wf_drz.fits -> wr124-hst-1997-f675w.fits
: /Users/will/Work/WR124-HST/MAST_2023-04-03T1936/HLA//hst_06787_01_wfpc2_f555w_wf/hst_06787_01_wfpc2_f555w_wf_drz.fits -> wr124-hst-1997-f555w.fits
: /Users/will/Work/WR124-HST/MAST_2023-04-03T1936/HLA//hst_11137_01_wfpc2_f656n_wf/hst_11137_01_wfpc2_f656n_wf_drz.fits -> wr124-hst-2008-f656n.fits

****** Do HST local background subtraction
#+begin_src sh :dir data :results verbatim
  for f in wr124-hst-????-f????.fits; do
      python ../scripts/findbg-local.py $f
  done

#+end_src

#+RESULTS:

****** Source finding in HST images
First try with brightness limit of 2 and radius of 3
#+begin_src sh :dir data :results verbatim
  python ../scripts/find-sources.py wr124-hst-1997-f656n_BGSUB.fits 3.0 2.0
#+end_src

#+RESULTS:
: Source list saved to wr124-hst-1997-f656n_BGSUB-sources-fwhm3.0-thresh2.ecsv
: Region file saved to wr124-hst-1997-f656n_BGSUB-sources-fwhm3.0-thresh2.reg

#+begin_src sh :dir data :results verbatim
  python ../scripts/find-sources.py wr124-hst-2008-f656n_BGSUB.fits 3.0 2.0
#+end_src

#+RESULTS:
: Source list saved to wr124-hst-2008-f656n_BGSUB-sources-fwhm3.0-thresh2.ecsv
: Region file saved to wr124-hst-2008-f656n_BGSUB-sources-fwhm3.0-thresh2.reg

Try reducing brightness limit and radius

#+begin_src sh :dir data :results verbatim
  python ../scripts/find-sources.py wr124-hst-1997-f656n_BGSUB.fits 2.0 1.0
#+end_src

#+RESULTS:
: Source list saved to wr124-hst-1997-f656n_BGSUB-sources-fwhm2.0-thresh1.ecsv
: Region file saved to wr124-hst-1997-f656n_BGSUB-sources-fwhm2.0-thresh1.reg
#+begin_src sh :dir data :results verbatim
  python ../scripts/find-sources.py wr124-hst-2008-f656n_BGSUB.fits 2.0 1.0
#+end_src

#+RESULTS:
: Source list saved to wr124-hst-2008-f656n_BGSUB-sources-fwhm2.0-thresh1.ecsv
: Region file saved to wr124-hst-2008-f656n_BGSUB-sources-fwhm2.0-thresh1.reg

This works the best. It looks like we have about 20 stars coincident between the two epochs in Ha

Now try the wide band. Increase threshold by factor of 10 since stars are brighter in this filter
#+begin_src sh :dir data :results verbatim
  python ../scripts/find-sources.py wr124-hst-1997-f675w_BGSUB.fits 2.0 10.0
#+end_src

#+RESULTS:
: Source list saved to wr124-hst-1997-f675w_BGSUB-sources-fwhm2.0-thresh10.ecsv
: Region file saved to wr124-hst-1997-f675w_BGSUB-sources-fwhm2.0-thresh10.reg

This finds a superset of the same stars

And the V band

#+begin_src sh :dir data :results verbatim
  python ../scripts/find-sources.py wr124-hst-1997-f555w_BGSUB.fits 2.0 10.0
#+end_src

#+RESULTS:
: Source list saved to wr124-hst-1997-f555w_BGSUB-sources-fwhm2.0-thresh10.ecsv
: Region file saved to wr124-hst-1997-f555w_BGSUB-sources-fwhm2.0-thresh10.reg

****** Source matching and aligning of HST images

******* Two epochs of H alpha
#+begin_src sh :dir data :results verbatim
  python ../scripts/find-offset.py \
         wr124-hst-1997-f656n_BGSUB wr124-hst-2008-f656n_BGSUB \
         fwhm2.0-thresh1 fwhm2.0-thresh1 \
         --minimum-radius-arcsec 1.0 --maximum-separation-arcsec 0.3 \
         --object-name wr124 --combo-prefix wr124-hst-f656n-1997-TO-2008
#+end_src

#+RESULTS:
: Statistics based on 28 coincident sources
: Mean displacement in RA: -2.45 +/- 4.04 marcsec
: Mean displacement in Dec: -20.85 +/- 6.88 marcsec
: Median displacement in RA: 0.95 +/- 4.56 marcsec
: Median displacement in Dec: -25.26 +/- 4.88 marcsec

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets.py wr124-hst-f656n-1997-TO-2008-OFFSETS.ecsv
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-hst-f656n-1997-TO-2008-OFFSETS.pdf]]

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets-corr.py wr124-hst-f656n-1997-TO-2008-OFFSETS.ecsv
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-hst-f656n-1997-TO-2008-OFFSETS-CORR.pdf]]

******* H alpha versus continuum for first epoch
#+begin_src sh :dir data :results verbatim
  python ../scripts/find-offset.py \
         wr124-hst-1997-f656n_BGSUB wr124-hst-1997-f675w_BGSUB \
         fwhm2.0-thresh1 fwhm2.0-thresh10 \
         --minimum-radius-arcsec 1.0 --maximum-separation-arcsec 0.3 \
         --object-name wr124 --combo-prefix wr124-hst-1997-f656n-TO-f675w
#+end_src

#+RESULTS:
: Statistics based on 43 coincident sources
: Mean displacement in RA: 6.42 +/- 2.30 marcsec
: Mean displacement in Dec: 46.07 +/- 8.35 marcsec
: Median displacement in RA: 6.90 +/- 2.89 marcsec
: Median displacement in Dec: 53.72 +/- 2.74 marcsec

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets.py wr124-hst-1997-f656n-TO-f675w-OFFSETS.ecsv
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-hst-1997-f656n-TO-f675w-OFFSETS.pdf]]

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets-corr.py wr124-hst-1997-f656n-TO-f675w-OFFSETS.ecsv
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-hst-1997-f656n-TO-f675w-OFFSETS-CORR.pdf]]

******* Green to red continuum
#+begin_src sh :dir data :results verbatim
  python ../scripts/find-offset.py \
         wr124-hst-1997-f555w_BGSUB wr124-hst-1997-f675w_BGSUB \
         fwhm2.0-thresh10 fwhm2.0-thresh10 \
         --minimum-radius-arcsec 1.0 --maximum-separation-arcsec 0.3 \
         --object-name wr124 --combo-prefix wr124-hst-1997-f555w-TO-f675w
#+end_src

#+RESULTS:
: Statistics based on 93 coincident sources
: Mean displacement in RA: -12.09 +/- 1.46 marcsec
: Mean displacement in Dec: 54.96 +/- 3.72 marcsec
: Median displacement in RA: -11.81 +/- 1.00 marcsec
: Median displacement in Dec: 59.20 +/- 1.13 marcsec

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets.py wr124-hst-1997-f555w-TO-f675w-OFFSETS.ecsv
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-hst-1997-f555w-TO-f675w-OFFSETS.pdf]]

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets-corr.py wr124-hst-1997-f555w-TO-f675w-OFFSETS.ecsv
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-hst-1997-f555w-TO-f675w-OFFSETS-CORR.pdf]]


******* H alpha versus green continuum
#+begin_src sh :dir data :results verbatim
  python ../scripts/find-offset.py \
         wr124-hst-1997-f656n_BGSUB wr124-hst-1997-f555w_BGSUB \
         fwhm2.0-thresh1 fwhm2.0-thresh10 \
         --minimum-radius-arcsec 1.0 --maximum-separation-arcsec 0.3 \
         --object-name wr124 --combo-prefix wr124-hst-1997-f656n-TO-f555w
#+end_src

#+RESULTS:
: Statistics based on 43 coincident sources
: Mean displacement in RA: 17.14 +/- 2.54 marcsec
: Mean displacement in Dec: -4.34 +/- 2.21 marcsec
: Median displacement in RA: 18.26 +/- 2.11 marcsec
: Median displacement in Dec: -5.80 +/- 2.28 marcsec

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets.py wr124-hst-1997-f656n-TO-f555w-OFFSETS.ecsv
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-hst-1997-f656n-TO-f555w-OFFSETS.pdf]]

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets-corr.py wr124-hst-1997-f656n-TO-f555w-OFFSETS.ecsv
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-hst-1997-f656n-TO-f555w-OFFSETS-CORR.pdf]]

******* H alpha 2008 to red continuum 1997
- We want to use the 1997 f675w image as the reference since it has the most accurate transformation to the GAIA frame

#+begin_src sh :dir data :results verbatim
  python ../scripts/find-offset.py \
         wr124-hst-2008-f656n_BGSUB wr124-hst-1997-f675w_BGSUB \
         fwhm2.0-thresh1 fwhm2.0-thresh10 \
         --minimum-radius-arcsec 1.0 --maximum-separation-arcsec 0.3 \
         --object-name wr124 --combo-prefix wr124-hst-2008-f656n-TO-1997-f675w
#+end_src

#+RESULTS:
: Statistics based on 29 coincident sources
: Mean displacement in RA: 9.84 +/- 4.38 marcsec
: Mean displacement in Dec: 64.21 +/- 13.98 marcsec
: Median displacement in RA: 11.95 +/- 4.07 marcsec
: Median displacement in Dec: 78.40 +/- 7.17 marcsec

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets.py wr124-hst-2008-f656n-TO-1997-f675w-OFFSETS.ecsv
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-hst-2008-f656n-TO-1997-f675w-OFFSETS.pdf]]

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets-corr.py wr124-hst-2008-f656n-TO-1997-f675w-OFFSETS.ecsv
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-hst-2008-f656n-TO-1997-f675w-OFFSETS-CORR.pdf]]

******* Help on script
#+begin_src sh :dir data :results verbatim
  python ../scripts/find-offset.py --help
#+end_src

#+RESULTS:
#+begin_example
Usage: find-offset.py [OPTIONS] FILE_PREFIXES... CATALOG_SUFFIXES...

Arguments:
  FILE_PREFIXES...     [required]
  CATALOG_SUFFIXES...  [required]

Options:
  --maximum-separation-arcsec FLOAT
                                  [default: 1.0]
  --maximum-radius-arcsec FLOAT
  --minimum-radius-arcsec FLOAT
  --object-name TEXT              [default: ngc 346]
  --install-completion            Install completion for the current shell.
  --show-completion               Show completion for the current shell, to
                                  copy it or customize the installation.

  --help                          Show this message and exit.
#+end_example

****** TODO Apply shifts to HST images
- We will use the 1997 Ha image as the reference and do WCS adjustments to all the others
- We were finding the displacements from A \to B, which is (B - A)
- So, if we want to correct the B coordinates to the A ones, then we need to subtract those
  - B - (B - A) = A




***** JWST images

****** Copy the original JWST images to working directory
#+begin_src sh :dir data :results verbatim
  D=/Users/will/Work/WR124-JWST/MAST_2023-09-13T2208/JWST
  for FN in f090w f150w f210m f335m f444w; do
      cp -av $D/jw02730-o001_t013_nircam_clear-${FN}/jw02730-o001_t013_nircam_clear-${FN}_i2d.fits wr124-jwst-nircam-2022-${FN}.fits
  done
  for FN in f470n; do
      cp -av $D/jw02730-o001_t013_nircam_f444w-${FN}/jw02730-o001_t013_nircam_f444w-${FN}_i2d.fits wr124-jwst-nircam-2022-${FN}.fits
  done
  for FN in f1130w f1280w f1800w f770w; do
      cp -av $D/jw02730-o002_t013_miri_${FN}/jw02730-o002_t013_miri_${FN}_i2d.fits wr124-jwst-miri-2022-${FN}.fits
  done
#+end_src

#+RESULTS:
#+begin_example
/Users/will/Work/WR124-JWST/MAST_2023-09-13T2208/JWST/jw02730-o001_t013_nircam_clear-f090w/jw02730-o001_t013_nircam_clear-f090w_i2d.fits -> wr124-jwst-nircam-2022-f090w.fits
/Users/will/Work/WR124-JWST/MAST_2023-09-13T2208/JWST/jw02730-o001_t013_nircam_clear-f150w/jw02730-o001_t013_nircam_clear-f150w_i2d.fits -> wr124-jwst-nircam-2022-f150w.fits
/Users/will/Work/WR124-JWST/MAST_2023-09-13T2208/JWST/jw02730-o001_t013_nircam_clear-f210m/jw02730-o001_t013_nircam_clear-f210m_i2d.fits -> wr124-jwst-nircam-2022-f210m.fits
/Users/will/Work/WR124-JWST/MAST_2023-09-13T2208/JWST/jw02730-o001_t013_nircam_clear-f335m/jw02730-o001_t013_nircam_clear-f335m_i2d.fits -> wr124-jwst-nircam-2022-f335m.fits
/Users/will/Work/WR124-JWST/MAST_2023-09-13T2208/JWST/jw02730-o001_t013_nircam_clear-f444w/jw02730-o001_t013_nircam_clear-f444w_i2d.fits -> wr124-jwst-nircam-2022-f444w.fits
/Users/will/Work/WR124-JWST/MAST_2023-09-13T2208/JWST/jw02730-o001_t013_nircam_f444w-f470n/jw02730-o001_t013_nircam_f444w-f470n_i2d.fits -> wr124-jwst-nircam-2022-f470n.fits
/Users/will/Work/WR124-JWST/MAST_2023-09-13T2208/JWST/jw02730-o002_t013_miri_f1130w/jw02730-o002_t013_miri_f1130w_i2d.fits -> wr124-jwst-miri-2022-f1130w.fits
/Users/will/Work/WR124-JWST/MAST_2023-09-13T2208/JWST/jw02730-o002_t013_miri_f1280w/jw02730-o002_t013_miri_f1280w_i2d.fits -> wr124-jwst-miri-2022-f1280w.fits
/Users/will/Work/WR124-JWST/MAST_2023-09-13T2208/JWST/jw02730-o002_t013_miri_f1800w/jw02730-o002_t013_miri_f1800w_i2d.fits -> wr124-jwst-miri-2022-f1800w.fits
/Users/will/Work/WR124-JWST/MAST_2023-09-13T2208/JWST/jw02730-o002_t013_miri_f770w/jw02730-o002_t013_miri_f770w_i2d.fits -> wr124-jwst-miri-2022-f770w.fits
#+end_example

****** Do JWST local background subtraction
Do all the NIRCAM filters first

#+header: :prologue exec 2>&1 :epilogue :
#+begin_src sh :dir data :results verbatim
  for FN in f090w f150w f210m f335m f444w f470n; do
      time python ../scripts/findbg-local.py wr124-jwst-nircam-2022-${FN}.fits
  done
#+end_src

#+RESULTS:
#+begin_example
WARNING: FITSFixedWarning: 'datfix' made the change 'Set DATE-BEG to '2022-06-03T06:35:24.581' from MJD-BEG.
Set DATE-AVG to '2022-06-03T06:52:40.729' from MJD-AVG.
Set DATE-END to '2022-06-03T07:09:56.817' from MJD-END'. [astropy.wcs.wcs]
WARNING: FITSFixedWarning: 'obsfix' made the change 'Set OBSGEO-L to   -82.793158 from OBSGEO-[XYZ].
Set OBSGEO-B to   -31.526408 from OBSGEO-[XYZ].
Set OBSGEO-H to 1653717953.818 from OBSGEO-[XYZ]'. [astropy.wcs.wcs]
WARNING: Input data contains invalid values (NaNs or infs), which were automatically masked. [photutils.background.background_2d]

real	0m13.047s
user	0m10.931s
sys	0m2.341s
WARNING: FITSFixedWarning: 'datfix' made the change 'Set DATE-BEG to '2022-06-03T07:13:31.554' from MJD-BEG.
Set DATE-AVG to '2022-06-03T07:30:47.696' from MJD-AVG.
Set DATE-END to '2022-06-03T07:48:03.790' from MJD-END'. [astropy.wcs.wcs]
WARNING: FITSFixedWarning: 'obsfix' made the change 'Set OBSGEO-L to   -82.780435 from OBSGEO-[XYZ].
Set OBSGEO-B to   -31.535128 from OBSGEO-[XYZ].
Set OBSGEO-H to 1653849940.851 from OBSGEO-[XYZ]'. [astropy.wcs.wcs]
WARNING: Input data contains invalid values (NaNs or infs), which were automatically masked. [photutils.background.background_2d]

real	0m12.342s
user	0m10.826s
sys	0m2.247s
WARNING: FITSFixedWarning: 'datfix' made the change 'Set DATE-BEG to '2022-06-03T05:36:53.693' from MJD-BEG.
Set DATE-AVG to '2022-06-03T06:04:02.984' from MJD-AVG.
Set DATE-END to '2022-06-03T06:31:17.715' from MJD-END'. [astropy.wcs.wcs]
WARNING: FITSFixedWarning: 'obsfix' made the change 'Set OBSGEO-L to   -82.806568 from OBSGEO-[XYZ].
Set OBSGEO-B to   -31.517218 from OBSGEO-[XYZ].
Set OBSGEO-H to 1653578937.800 from OBSGEO-[XYZ]'. [astropy.wcs.wcs]
WARNING: Input data contains invalid values (NaNs or infs), which were automatically masked. [photutils.background.background_2d]

real	0m13.507s
user	0m11.649s
sys	0m2.360s
WARNING: FITSFixedWarning: 'datfix' made the change 'Set DATE-BEG to '2022-06-03T06:35:24.645' from MJD-BEG.
Set DATE-AVG to '2022-06-03T06:52:40.747' from MJD-AVG.
Set DATE-END to '2022-06-03T07:09:56.881' from MJD-END'. [astropy.wcs.wcs]
WARNING: FITSFixedWarning: 'obsfix' made the change 'Set OBSGEO-L to   -82.803316 from OBSGEO-[XYZ].
Set OBSGEO-B to   -31.519446 from OBSGEO-[XYZ].
Set OBSGEO-H to 1653612642.314 from OBSGEO-[XYZ]'. [astropy.wcs.wcs]
WARNING: Input data contains invalid values (NaNs or infs), which were automatically masked. [photutils.background.background_2d]

real	0m4.530s
user	0m4.305s
sys	0m1.333s
WARNING: FITSFixedWarning: 'datfix' made the change 'Set DATE-BEG to '2022-06-03T07:13:31.618' from MJD-BEG.
Set DATE-AVG to '2022-06-03T07:30:47.704' from MJD-AVG.
Set DATE-END to '2022-06-03T07:48:03.790' from MJD-END'. [astropy.wcs.wcs]
WARNING: FITSFixedWarning: 'obsfix' made the change 'Set OBSGEO-L to   -82.778744 from OBSGEO-[XYZ].
Set OBSGEO-B to   -31.536287 from OBSGEO-[XYZ].
Set OBSGEO-H to 1653867491.040 from OBSGEO-[XYZ]'. [astropy.wcs.wcs]
WARNING: Input data contains invalid values (NaNs or infs), which were automatically masked. [photutils.background.background_2d]

real	0m4.235s
user	0m4.199s
sys	0m1.286s
WARNING: FITSFixedWarning: 'datfix' made the change 'Set DATE-BEG to '2022-06-03T05:36:53.693' from MJD-BEG.
Set DATE-AVG to '2022-06-03T06:04:03.008' from MJD-AVG.
Set DATE-END to '2022-06-03T06:31:17.715' from MJD-END'. [astropy.wcs.wcs]
WARNING: FITSFixedWarning: 'obsfix' made the change 'Set OBSGEO-L to   -82.825006 from OBSGEO-[XYZ].
Set OBSGEO-B to   -31.504583 from OBSGEO-[XYZ].
Set OBSGEO-H to 1653387953.977 from OBSGEO-[XYZ]'. [astropy.wcs.wcs]
WARNING: Input data contains invalid values (NaNs or infs), which were automatically masked. [photutils.background.background_2d]

real	0m4.209s
user	0m4.161s
sys	0m1.305s
#+end_example

Now all the MIRI filters

#+header: :prologue exec 2>&1 :epilogue :
#+begin_src sh :dir data :results verbatim
  for FN in f770w f1130w f1280w f1800w; do
      time python ../scripts/findbg-local.py wr124-jwst-miri-2022-${FN}.fits
  done
#+end_src

#+RESULTS:
#+begin_example
WARNING: FITSFixedWarning: 'datfix' made the change 'Set DATE-BEG to '2022-06-10T19:13:15.243' from MJD-BEG.
Set DATE-AVG to '2022-06-10T20:42:59.464' from MJD-AVG.
Set DATE-END to '2022-06-10T22:12:50.973' from MJD-END'. [astropy.wcs.wcs]
WARNING: FITSFixedWarning: 'obsfix' made the change 'Set OBSGEO-L to   -79.020464 from OBSGEO-[XYZ].
Set OBSGEO-B to   -34.077472 from OBSGEO-[XYZ].
Set OBSGEO-H to 1694854319.412 from OBSGEO-[XYZ]'. [astropy.wcs.wcs]
WARNING: Input data contains invalid values (NaNs or infs), which were automatically masked. [photutils.background.background_2d]

real	0m15.767s
user	0m2.877s
sys	0m1.215s
WARNING: FITSFixedWarning: 'datfix' made the change 'Set DATE-BEG to '2022-06-10T19:49:39.240' from MJD-BEG.
Set DATE-AVG to '2022-06-10T21:19:22.082' from MJD-AVG.
Set DATE-END to '2022-06-10T22:49:09.403' from MJD-END'. [astropy.wcs.wcs]
WARNING: FITSFixedWarning: 'obsfix' made the change 'Set OBSGEO-L to   -79.011629 from OBSGEO-[XYZ].
Set OBSGEO-B to   -34.083187 from OBSGEO-[XYZ].
Set OBSGEO-H to 1694947246.087 from OBSGEO-[XYZ]'. [astropy.wcs.wcs]
WARNING: Input data contains invalid values (NaNs or infs), which were automatically masked. [photutils.background.background_2d]

real	0m2.169s
user	0m2.684s
sys	0m1.022s
WARNING: FITSFixedWarning: 'datfix' made the change 'Set DATE-BEG to '2022-06-10T20:24:51.110' from MJD-BEG.
Set DATE-AVG to '2022-06-10T21:54:36.204' from MJD-AVG.
Set DATE-END to '2022-06-10T23:24:18.521' from MJD-END'. [astropy.wcs.wcs]
WARNING: FITSFixedWarning: 'obsfix' made the change 'Set OBSGEO-L to   -79.005847 from OBSGEO-[XYZ].
Set OBSGEO-B to   -34.086925 from OBSGEO-[XYZ].
Set OBSGEO-H to 1695008013.869 from OBSGEO-[XYZ]'. [astropy.wcs.wcs]
WARNING: Input data contains invalid values (NaNs or infs), which were automatically masked. [photutils.background.background_2d]

real	0m2.488s
user	0m2.729s
sys	0m1.099s
WARNING: FITSFixedWarning: 'datfix' made the change 'Set DATE-BEG to '2022-06-10T21:00:27.917' from MJD-BEG.
Set DATE-AVG to '2022-06-10T22:30:14.762' from MJD-AVG.
Set DATE-END to '2022-06-11T00:00:03.671' from MJD-END'. [astropy.wcs.wcs]
WARNING: FITSFixedWarning: 'obsfix' made the change 'Set OBSGEO-L to   -78.991877 from OBSGEO-[XYZ].
Set OBSGEO-B to   -34.095956 from OBSGEO-[XYZ].
Set OBSGEO-H to 1695154734.210 from OBSGEO-[XYZ]'. [astropy.wcs.wcs]
WARNING: Input data contains invalid values (NaNs or infs), which were automatically masked. [photutils.background.background_2d]

real	0m2.273s
user	0m2.819s
sys	0m0.995s
#+end_example


****** Source finding in JWST images

#+begin_src sh :dir data :results verbatim
  for f in wr124-jwst-nircam-2022-f????_BGSUB.fits; do
      python ../scripts/find-sources.py $f 5.0 30.0
  done
#+end_src

#+RESULTS:
#+begin_example
Source list saved to wr124-jwst-nircam-2022-f090w_BGSUB-sources-fwhm5.0-thresh30.ecsv
Region file saved to wr124-jwst-nircam-2022-f090w_BGSUB-sources-fwhm5.0-thresh30.reg
Source list saved to wr124-jwst-nircam-2022-f150w_BGSUB-sources-fwhm5.0-thresh30.ecsv
Region file saved to wr124-jwst-nircam-2022-f150w_BGSUB-sources-fwhm5.0-thresh30.reg
Source list saved to wr124-jwst-nircam-2022-f210m_BGSUB-sources-fwhm5.0-thresh30.ecsv
Region file saved to wr124-jwst-nircam-2022-f210m_BGSUB-sources-fwhm5.0-thresh30.reg
Source list saved to wr124-jwst-nircam-2022-f335m_BGSUB-sources-fwhm5.0-thresh30.ecsv
Region file saved to wr124-jwst-nircam-2022-f335m_BGSUB-sources-fwhm5.0-thresh30.reg
Source list saved to wr124-jwst-nircam-2022-f444w_BGSUB-sources-fwhm5.0-thresh30.ecsv
Region file saved to wr124-jwst-nircam-2022-f444w_BGSUB-sources-fwhm5.0-thresh30.reg
Source list saved to wr124-jwst-nircam-2022-f470n_BGSUB-sources-fwhm5.0-thresh30.ecsv
Region file saved to wr124-jwst-nircam-2022-f470n_BGSUB-sources-fwhm5.0-thresh30.reg
#+end_example

#+begin_src sh :dir data :results verbatim
  for f in wr124-jwst-miri-2022-f*w_BGSUB.fits; do
      python ../scripts/find-sources.py $f 5.0 30.0
  done
#+end_src

#+RESULTS:
: Source list saved to wr124-jwst-miri-2022-f1130w_BGSUB-sources-fwhm5.0-thresh30.ecsv
: Region file saved to wr124-jwst-miri-2022-f1130w_BGSUB-sources-fwhm5.0-thresh30.reg
: Source list saved to wr124-jwst-miri-2022-f1280w_BGSUB-sources-fwhm5.0-thresh30.ecsv
: Region file saved to wr124-jwst-miri-2022-f1280w_BGSUB-sources-fwhm5.0-thresh30.reg
: Source list saved to wr124-jwst-miri-2022-f1800w_BGSUB-sources-fwhm5.0-thresh30.ecsv
: Region file saved to wr124-jwst-miri-2022-f1800w_BGSUB-sources-fwhm5.0-thresh30.reg
: Source list saved to wr124-jwst-miri-2022-f770w_BGSUB-sources-fwhm5.0-thresh30.ecsv
: Region file saved to wr124-jwst-miri-2022-f770w_BGSUB-sources-fwhm5.0-thresh30.reg

****** Source matching and aligning of JWST images

******* Match JWST f090w to HST 1999 continuum and Ha

First the continuum. We put in a guess of 1 arcsec offset in RA, since that looks more or less right. 
#+begin_src sh :dir data :results verbatim
  python ../scripts/find-offset.py \
         wr124-hst-1997-f675w_BGSUB wr124-jwst-nircam-2022-f090w_BGSUB \
         fwhm2.0-thresh1 fwhm5.0-thresh30 \
         --minimum-radius-arcsec 1.0 --maximum-separation-arcsec 0.3 \
         --guess-offset 1.0 --guess-pa 270.0 \
         --object-name wr124 --combo-prefix wr124-hst-1997-f675w-TO-jwst-2022-f090w
#+end_src

#+RESULTS:
: Statistics based on 246 coincident sources
: Mean displacement in RA: -1026.00 +/- 4.16 marcsec
: Mean displacement in Dec: 73.80 +/- 3.48 marcsec
: Median displacement in RA: -1036.43 +/- 1.92 marcsec
: Median displacement in Dec: 76.99 +/- 2.70 marcsec

So this works really well. We have a lot of coincident stars and their offsets are nice and tightly distributed. 

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets.py wr124-hst-1997-f675w-TO-jwst-2022-f090w-OFFSETS.ecsv
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-hst-1997-f675w-TO-jwst-2022-f090w-OFFSETS.pdf]]

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets-corr.py wr124-hst-1997-f675w-TO-jwst-2022-f090w-OFFSETS.ecsv
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-hst-1997-f675w-TO-jwst-2022-f090w-OFFSETS-CORR.pdf]]

#+begin_src sh :dir data :results verbatim
  python ../scripts/find-offset.py \
         wr124-hst-1997-f656n_BGSUB wr124-jwst-nircam-2022-f090w_BGSUB \
         fwhm2.0-thresh1 fwhm5.0-thresh30 \
         --minimum-radius-arcsec 1.0 --maximum-separation-arcsec 0.3 \
         --guess-offset 1.0 --guess-pa 270.0 \
         --object-name wr124 --combo-prefix wr124-hst-1997-f656n-TO-jwst-2022-f090w
#+end_src

#+RESULTS:
: Statistics based on 12 coincident sources
: Mean displacement in RA: -885.80 +/- 52.51 marcsec
: Mean displacement in Dec: 34.33 +/- 22.94 marcsec
: Median displacement in RA: -780.75 +/- 15.10 marcsec
: Median displacement in Dec: 51.26 +/- 14.64 marcsec

This is less satisfactory because it found very few coincident sources, so it would be better to use the continuum to tie these together
#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets.py wr124-hst-1997-f656n-TO-jwst-2022-f090w-OFFSETS.ecsv
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-hst-1997-f656n-TO-jwst-2022-f090w-OFFSETS.pdf]]

******* Match between NIRCAM JWST filters

******** f090w to f150w
#+begin_src sh :dir data :results verbatim
  python ../scripts/find-offset.py \
         wr124-jwst-nircam-2022-f090w_BGSUB wr124-jwst-nircam-2022-f150w_BGSUB \
         fwhm5.0-thresh30 fwhm5.0-thresh30 \
         --minimum-radius-arcsec 1.0 --maximum-separation-arcsec 0.3 \
         --guess-offset 0.0 --guess-pa 0.0 \
         --object-name wr124 --combo-prefix wr124-jwst-2022-f090w-TO-f150w
#+end_src

#+RESULTS:
: Statistics based on 409 coincident sources
: Mean displacement in RA: 0.96 +/- 2.44 marcsec
: Mean displacement in Dec: 1.74 +/- 2.66 marcsec
: Median displacement in RA: -0.38 +/- 0.16 marcsec
: Median displacement in Dec: -3.99 +/- 0.16 marcsec

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets.py wr124-jwst-2022-f090w-TO-f150w-OFFSETS.ecsv --max-sep 30
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f090w-TO-f150w-OFFSETS.pdf]]

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets-corr.py wr124-jwst-2022-f090w-TO-f150w-OFFSETS.ecsv --max-sep 30
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f090w-TO-f150w-OFFSETS-CORR.pdf]]

******** f150w to f210m
#+begin_src sh :dir data :results verbatim
  python ../scripts/find-offset.py \
         wr124-jwst-nircam-2022-f150w_BGSUB wr124-jwst-nircam-2022-f210m_BGSUB \
         fwhm5.0-thresh30 fwhm5.0-thresh30 \
         --minimum-radius-arcsec 1.0 --maximum-separation-arcsec 0.3 \
         --guess-offset 0.0 --guess-pa 0.0 \
         --object-name wr124 --combo-prefix wr124-jwst-2022-f150w-TO-f210m
#+end_src

#+RESULTS:
: Statistics based on 2143 coincident sources
: Mean displacement in RA: 1.56 +/- 0.66 marcsec
: Mean displacement in Dec: -3.19 +/- 0.75 marcsec
: Median displacement in RA: 3.01 +/- 0.02 marcsec
: Median displacement in Dec: -2.20 +/- 0.03 marcsec

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets.py wr124-jwst-2022-f150w-TO-f210m-OFFSETS.ecsv --max-sep 30
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f150w-TO-f210m-OFFSETS.pdf]]

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets-corr.py wr124-jwst-2022-f150w-TO-f210m-OFFSETS.ecsv --max-sep 10
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f150w-TO-f210m-OFFSETS-CORR.pdf]]

- This is finally showing a distortion effect:
  - we see systematic variation of dRA with RA and dDEC with DEC
  - but it is very small!
  - only 5 mas per 100 arcsec
  - But on the other hand, it is comparable to the median shift

******** f210m to f335m
#+begin_src sh :dir data :results verbatim
  python ../scripts/find-offset.py \
         wr124-jwst-nircam-2022-f210m_BGSUB wr124-jwst-nircam-2022-f335m_BGSUB \
         fwhm5.0-thresh30 fwhm5.0-thresh30 \
         --minimum-radius-arcsec 1.0 --maximum-separation-arcsec 0.3 \
         --guess-offset 0.0 --guess-pa 0.0 \
         --object-name wr124 --combo-prefix wr124-jwst-2022-f210m-TO-f335m
#+end_src

#+RESULTS:
: Statistics based on 838 coincident sources
: Mean displacement in RA: 7.31 +/- 1.61 marcsec
: Mean displacement in Dec: -33.10 +/- 1.74 marcsec
: Median displacement in RA: 0.51 +/- 0.13 marcsec
: Median displacement in Dec: -43.65 +/- 0.09 marcsec

This has a much larger displacement in Dec than between the other NIRCAM filters,  which we can  see in the RGB image

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets.py wr124-jwst-2022-f210m-TO-f335m-OFFSETS.ecsv --max-sep 30
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f210m-TO-f335m-OFFSETS.pdf]]

There is a strange bifurcation in  dRA distributions between the small radii and the large radii
#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets-corr.py wr124-jwst-2022-f210m-TO-f335m-OFFSETS.ecsv --max-sep 10
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f210m-TO-f335m-OFFSETS-CORR.pdf]]

There is a slight trend in displacement as a function of position,   but this time it is even apparent in the cross terms: e.g., dRA vs DEC

This could be explained as a combination of expansion and rotation


******** f335m to f444w
#+begin_src sh :dir data :results verbatim
  python ../scripts/find-offset.py \
         wr124-jwst-nircam-2022-f335m_BGSUB wr124-jwst-nircam-2022-f444w_BGSUB \
         fwhm5.0-thresh30 fwhm5.0-thresh30 \
         --minimum-radius-arcsec 1.0 --maximum-separation-arcsec 0.3 \
         --guess-offset 0.0 --guess-pa 0.0 \
         --object-name wr124 --combo-prefix wr124-jwst-2022-f335m-TO-f444w
#+end_src

#+RESULTS:
: Statistics based on 466 coincident sources
: Mean displacement in RA: 4.51 +/- 0.92 marcsec
: Mean displacement in Dec: 5.15 +/- 1.35 marcsec
: Median displacement in RA: 3.78 +/- 0.08 marcsec
: Median displacement in Dec: 5.22 +/- 0.06 marcsec

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets.py wr124-jwst-2022-f335m-TO-f444w-OFFSETS.ecsv --max-sep 30
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f335m-TO-f444w-OFFSETS.pdf]]

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets-corr.py wr124-jwst-2022-f335m-TO-f444w-OFFSETS.ecsv --max-sep 10
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f335m-TO-f444w-OFFSETS-CORR.pdf]]

******** f444w to f470n
#+begin_src sh :dir data :results verbatim
  python ../scripts/find-offset.py \
         wr124-jwst-nircam-2022-f444w_BGSUB wr124-jwst-nircam-2022-f470n_BGSUB \
         fwhm5.0-thresh30 fwhm5.0-thresh30 \
         --minimum-radius-arcsec 1.0 --maximum-separation-arcsec 0.3 \
         --guess-offset 0.0 --guess-pa 0.0 \
         --object-name wr124 --combo-prefix wr124-jwst-2022-f444w-TO-f470n
#+end_src

#+RESULTS:
: Statistics based on 391 coincident sources
: Mean displacement in RA: -4.98 +/- 1.17 marcsec
: Mean displacement in Dec: -14.62 +/- 1.51 marcsec
: Median displacement in RA: -6.57 +/- 0.87 marcsec
: Median displacement in Dec: -12.74 +/- 1.04 marcsec

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets.py wr124-jwst-2022-f444w-TO-f470n-OFFSETS.ecsv --max-sep 100
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f444w-TO-f470n-OFFSETS.pdf]]

This has more dispersion and fewer sources than the other pairs we have done, but it still seems to give a reliable shift

The stars at smaller radii seem to have less dispersion in their displacements

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets-corr.py wr124-jwst-2022-f444w-TO-f470n-OFFSETS.ecsv --max-sep 100
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f444w-TO-f470n-OFFSETS-CORR.pdf]]

We get *very* strong linear correlation of dRA with RA and dDec with Dec, which suggests something strange might be going on

******* Match NIRCAM to MIRI
- Try this over the shortest gap: f444w to f770w
- We know that MIRI is well matched to HST, so is offset about 1 arcsec in RA from NIRCAM

#+begin_src sh :dir data :results verbatim
  python ../scripts/find-offset.py \
         wr124-jwst-nircam-2022-f444w_BGSUB wr124-jwst-miri-2022-f770w_BGSUB \
         fwhm5.0-thresh30 fwhm5.0-thresh30 \
         --minimum-radius-arcsec 1.0 --maximum-separation-arcsec 0.3 \
         --guess-offset 1.0 --guess-pa 90.0 \
         --object-name wr124 --combo-prefix wr124-jwst-2022-f444w-TO-f770w   
#+end_src

#+RESULTS:
: Statistics based on 42 coincident sources
: Mean displacement in RA: 1042.90 +/- 3.25 marcsec
: Mean displacement in Dec: 2.18 +/- 3.56 marcsec
: Median displacement in RA: 1042.42 +/- 4.65 marcsec
: Median displacement in Dec: 1.62 +/- 3.96 marcsec

This seems to have worked, but there are a disturbingly small number of sources

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets.py wr124-jwst-2022-f444w-TO-f770w-OFFSETS.ecsv --max-sep 100
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f444w-TO-f770w-OFFSETS.pdf]]

So the claimed accuracy is about 5 mas, but the distribution of offsets is not very gaussian, with sub clusters separated by about 20 mas, so that would be a better estimate of accuracy

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets-corr.py wr124-jwst-2022-f444w-TO-f770w-OFFSETS.ecsv --max-sep 100
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f444w-TO-f770w-OFFSETS-CORR.pdf]]

This shows a clear linear trend in the off-diagonal pairs, with opposite slopes, which is consistent with rotation

******* Match between MIRI filters

******** f770w to f1130w
#+begin_src sh :dir data :results verbatim
  python ../scripts/find-offset.py \
         wr124-jwst-miri-2022-f770w_BGSUB wr124-jwst-miri-2022-f1130w_BGSUB \
         fwhm5.0-thresh30 fwhm5.0-thresh30 \
         --minimum-radius-arcsec 1.0 --maximum-separation-arcsec 0.3 \
         --guess-offset 0.0 --guess-pa 0.0 \
         --object-name wr124 --combo-prefix wr124-jwst-2022-f770w-TO-f1130w   
#+end_src

#+RESULTS:
: Statistics based on 87 coincident sources
: Mean displacement in RA: 1.17 +/- 2.46 marcsec
: Mean displacement in Dec: -14.48 +/- 3.28 marcsec
: Median displacement in RA: -1.34 +/- 2.26 marcsec
: Median displacement in Dec: -13.62 +/- 1.80 marcsec

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets.py wr124-jwst-2022-f770w-TO-f1130w-OFFSETS.ecsv --max-sep 100
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f770w-TO-f1130w-OFFSETS.pdf]]

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets-corr.py wr124-jwst-2022-f770w-TO-f1130w-OFFSETS.ecsv --max-sep 100
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f770w-TO-f1130w-OFFSETS-CORR.pdf]]

Sources are very concentrated towards center in RA, but not in Dec

******** f1130w to f1280w
#+begin_src sh :dir data :results verbatim
  python ../scripts/find-offset.py \
         wr124-jwst-miri-2022-f1130w_BGSUB wr124-jwst-miri-2022-f1280w_BGSUB \
         fwhm5.0-thresh30 fwhm5.0-thresh30 \
         --minimum-radius-arcsec 1.0 --maximum-separation-arcsec 0.3 \
         --guess-offset 0.0 --guess-pa 0.0 \
         --object-name wr124 --combo-prefix wr124-jwst-2022-f1130w-TO-f1280w   
#+end_src

#+RESULTS:
: Statistics based on 92 coincident sources
: Mean displacement in RA: -3.51 +/- 7.95 marcsec
: Mean displacement in Dec: 9.03 +/- 9.86 marcsec
: Median displacement in RA: 1.97 +/- 5.84 marcsec
: Median displacement in Dec: 12.66 +/- 6.91 marcsec

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets.py wr124-jwst-2022-f1130w-TO-f1280w-OFFSETS.ecsv --max-sep 300
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f1130w-TO-f1280w-OFFSETS.pdf]]

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets-corr.py wr124-jwst-2022-f1130w-TO-f1280w-OFFSETS.ecsv --max-sep 300
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f1130w-TO-f1280w-OFFSETS-CORR.pdf]]

The close-in stars have a much larger dispersion than the farther out ones. I have no idea why this is the case

******** f1280w to f1800w
#+begin_src sh :dir data :results verbatim
  python ../scripts/find-offset.py \
         wr124-jwst-miri-2022-f1280w_BGSUB wr124-jwst-miri-2022-f1800w_BGSUB \
         fwhm5.0-thresh30 fwhm5.0-thresh30 \
         --minimum-radius-arcsec 1.0 --maximum-separation-arcsec 0.3 \
         --guess-offset 0.0 --guess-pa 0.0 \
         --object-name wr124 --combo-prefix wr124-jwst-2022-f1280w-TO-f1800w
#+end_src

#+RESULTS:
: Statistics based on 96 coincident sources
: Mean displacement in RA: -4.58 +/- 7.36 marcsec
: Mean displacement in Dec: 0.69 +/- 7.84 marcsec
: Median displacement in RA: -5.01 +/- 6.39 marcsec
: Median displacement in Dec: -15.72 +/- 6.82 marcsec

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets.py wr124-jwst-2022-f1280w-TO-f1800w-OFFSETS.ecsv
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f1280w-TO-f1800w-OFFSETS.pdf]]

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets-corr.py wr124-jwst-2022-f1280w-TO-f1800w-OFFSETS.ecsv  --alpha 0.3
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f1280w-TO-f1800w-OFFSETS-CORR.pdf]]



****** Apply shifts to JWST images
***** TODO Align to GAIA frame
- Maybe this would be a good idea


Get all the GAIA sources in the field with a radius of three arcmin

#+begin_src sh :dir data :results verbatim
  python ../scripts/get-gaia-catalog.py \
         --object-name wr124 \
         --search-radius-arcsec 180.0 
#+end_src

#+RESULTS:
: INFO: Query finished. [astroquery.utils.tap.core]
****** HST f675w continuum to GAIA
:PROPERTIES:
:ID:       CD08DF32-308B-4F9C-A6C5-A76C52482495
:END:
#+begin_src sh :dir data :results verbatim
  python ../scripts/find-offset.py \
         wr124-hst-1997-f675w_BGSUB gaia \
         fwhm2.0-thresh1 wr124 \
         --minimum-radius-arcsec 1.0 --maximum-separation-arcsec 0.3 \
         --guess-offset 0.0 --guess-pa 0.0 \
         --object-name wr124 --combo-prefix wr124-hst-1997-f675w-TO-gaia
#+end_src

#+RESULTS:
: Statistics based on 339 coincident sources
: Mean displacement in RA: -6.61 +/- 1.90 marcsec
: Mean displacement in Dec: -133.67 +/- 2.47 marcsec
: Median displacement in RA: -8.79 +/- 1.51 marcsec
: Median displacement in Dec: -136.61 +/- 2.04 marcsec

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets.py wr124-hst-1997-f675w-TO-gaia-OFFSETS.ecsv --max-sep 200
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-hst-1997-f675w-TO-gaia-OFFSETS.pdf]]

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets-corr.py wr124-hst-1997-f675w-TO-gaia-OFFSETS.ecsv --max-sep 200 --alpha 0.3
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-hst-1997-f675w-TO-gaia-OFFSETS-CORR.pdf]]

Slight evidence for a rotation of the HST frame with respect to GAIA
****** HST f555w to Gaia
#+begin_src sh :dir data :results verbatim
  python ../scripts/find-offset.py \
         wr124-hst-1997-f555w_BGSUB gaia \
         fwhm2.0-thresh10 wr124 \
         --minimum-radius-arcsec 1.0 --maximum-separation-arcsec 0.15 \
         --guess-offset 0.1 --guess-pa 180.0 \
         --object-name wr124 --combo-prefix wr124-hst-1997-f555w-TO-gaia
#+end_src

#+RESULTS:
: Statistics based on 93 coincident sources
: Mean displacement in RA: -15.87 +/- 3.22 marcsec
: Mean displacement in Dec: -81.64 +/- 4.57 marcsec
: Median displacement in RA: -20.04 +/- 2.94 marcsec
: Median displacement in Dec: -84.09 +/- 4.66 marcsec

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets.py wr124-hst-1997-f555w-TO-gaia-OFFSETS.ecsv 
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-hst-1997-f555w-TO-gaia-OFFSETS.pdf]]

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets-corr.py wr124-hst-1997-f555w-TO-gaia-OFFSETS.ecsv 
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-hst-1997-f555w-TO-gaia-OFFSETS-CORR.pdf]]

****** HST f656n Ha first epoch to Gaia
:PROPERTIES:
:ID:       F646740A-848E-4F5F-B333-5B931D06C3E4
:END:
#+begin_src sh :dir data :results verbatim
  python ../scripts/find-offset.py \
         wr124-hst-1997-f656n_BGSUB gaia \
         fwhm2.0-thresh1 wr124 \
         --minimum-radius-arcsec 1.0 --maximum-separation-arcsec 0.3 \
         --guess-offset 0.0 --guess-pa 0.0 \
         --object-name wr124 --combo-prefix wr124-hst-1997-f656n-TO-gaia
#+end_src

#+RESULTS:
: Statistics based on 43 coincident sources
: Mean displacement in RA: 11.58 +/- 5.43 marcsec
: Mean displacement in Dec: -79.62 +/- 8.62 marcsec
: Median displacement in RA: 4.13 +/- 5.43 marcsec
: Median displacement in Dec: -89.65 +/- 8.12 marcsec

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets.py wr124-hst-1997-f656n-TO-gaia-OFFSETS.ecsv
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-hst-1997-f656n-TO-gaia-OFFSETS.pdf]]

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets-corr.py wr124-hst-1997-f656n-TO-gaia-OFFSETS.ecsv --max-sep 200 --alpha 0.3
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-hst-1997-f656n-TO-gaia-OFFSETS-CORR.pdf]]

****** HST f656n Ha second epoch to Gaia
#+begin_src sh :dir data :results verbatim
  python ../scripts/find-offset.py \
         wr124-hst-2008-f656n_BGSUB gaia \
         fwhm2.0-thresh1 wr124 \
         --minimum-radius-arcsec 1.0 --maximum-separation-arcsec 0.3 \
         --guess-offset 0.0 --guess-pa 0.0 \
         --object-name wr124 --combo-prefix wr124-hst-2008-f656n-TO-gaia
#+end_src

#+RESULTS:
: Statistics based on 36 coincident sources
: Mean displacement in RA: 16.90 +/- 3.51 marcsec
: Mean displacement in Dec: -56.02 +/- 4.90 marcsec
: Median displacement in RA: 14.64 +/- 3.48 marcsec
: Median displacement in Dec: -55.21 +/- 4.64 marcsec

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets.py wr124-hst-2008-f656n-TO-gaia-OFFSETS.ecsv --max-sep 100
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-hst-2008-f656n-TO-gaia-OFFSETS.pdf]]

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets-corr.py wr124-hst-2008-f656n-TO-gaia-OFFSETS.ecsv --max-sep 200 --alpha 0.3
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-hst-2008-f656n-TO-gaia-OFFSETS-CORR.pdf]]

****** NIRCAM f090w to GAIA
#+begin_src sh :dir data :results verbatim
  python ../scripts/find-offset.py \
         wr124-jwst-nircam-2022-f090w_BGSUB gaia \
         fwhm5.0-thresh30 wr124 \
         --minimum-radius-arcsec 1.0 --maximum-separation-arcsec 0.3 \
         --guess-offset 1.0 --guess-pa 90.0 \
         --object-name wr124 --combo-prefix wr124-jwst-2022-f090w-TO-gaia
#+end_src

#+RESULTS:
: Statistics based on 122 coincident sources
: Mean displacement in RA: 1021.35 +/- 7.18 marcsec
: Mean displacement in Dec: -197.42 +/- 5.28 marcsec
: Median displacement in RA: 1022.59 +/- 1.41 marcsec
: Median displacement in Dec: -210.59 +/- 1.69 marcsec

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets.py wr124-jwst-2022-f090w-TO-gaia-OFFSETS.ecsv --max-sep 100
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f090w-TO-gaia-OFFSETS.pdf]]


#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets-corr.py wr124-jwst-2022-f090w-TO-gaia-OFFSETS.ecsv --max-sep 100 --alpha 0.3
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f090w-TO-gaia-OFFSETS-CORR.pdf]]

This shows clear signs of rotation

****** NIRCAM f090w to HST f675w
The GAIA alignments may be insufficiently precise, so we want to directly tie together NIRCAM and HST

Note that we reduce the max separation to 200 mas to avoid outliers (chosen by eye, based on experiments with larger values up to 500).  This yield fewer coincident sources,  but the results are more robust.

#+begin_src sh :dir data :results verbatim
    python ../scripts/find-offset.py \
           wr124-jwst-nircam-2022-f090w_BGSUB \
           wr124-hst-1997-f675w_BGSUB \
           fwhm5.0-thresh30 fwhm2.0-thresh10 \
           --minimum-radius-arcsec 1.0 --maximum-separation-arcsec 0.2 \
           --guess-offset 1.0 --guess-pa 90.0 \
           --object-name wr124 --combo-prefix wr124-jwst-2022-f090w-TO-hst-1997-f675w
#+end_src

#+RESULTS:
: Statistics based on 24 coincident sources
: Mean displacement in RA: 1020.60 +/- 14.32 marcsec
: Mean displacement in Dec: -60.63 +/- 9.70 marcsec
: Median displacement in RA: 1022.06 +/- 8.72 marcsec
: Median displacement in Dec: -56.72 +/- 7.19 marcsec

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets.py wr124-jwst-2022-f090w-TO-hst-1997-f675w-OFFSETS.ecsv 
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f090w-TO-hst-1997-f675w-OFFSETS.pdf]]

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets-corr.py wr124-jwst-2022-f090w-TO-hst-1997-f675w-OFFSETS.ecsv
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f090w-TO-hst-1997-f675w-OFFSETS-CORR.pdf]]

So this has bigger error bars than the Gaia alignment, which makes me think that we do want to go through GAIA after all for tying these together

Note that both HST and NIRCAM have similar rotations to the GAIA frame, so there is no significant relative rotation between the two instruments.

****** NIRCAM f150w to GAIA
#+begin_src sh :dir data :results verbatim
  python ../scripts/find-offset.py \
         wr124-jwst-nircam-2022-f150w_BGSUB gaia \
         fwhm5.0-thresh30 wr124 \
         --minimum-radius-arcsec 1.0 --maximum-separation-arcsec 0.3 \
         --guess-offset 1.0 --guess-pa 90.0 \
         --object-name wr124 --combo-prefix wr124-jwst-2022-f150w-TO-gaia
#+end_src

#+RESULTS:
: Statistics based on 109 coincident sources
: Mean displacement in RA: 1039.02 +/- 7.61 marcsec
: Mean displacement in Dec: -132.01 +/- 13.57 marcsec
: Median displacement in RA: 1027.28 +/- 1.64 marcsec
: Median displacement in Dec: -196.53 +/- 2.72 marcsec

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets.py wr124-jwst-2022-f150w-TO-gaia-OFFSETS.ecsv
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f150w-TO-gaia-OFFSETS.pdf]]

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets-corr.py wr124-jwst-2022-f150w-TO-gaia-OFFSETS.ecsv --alpha 0.3
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f150w-TO-gaia-OFFSETS-CORR.pdf]]

This one has the least satisfactory robust fit. I am going to try and improve it

****** NIRCAM f210m to GAIA
#+begin_src sh :dir data :results verbatim
  python ../scripts/find-offset.py \
         wr124-jwst-nircam-2022-f210m_BGSUB gaia \
         fwhm5.0-thresh30 wr124 \
         --minimum-radius-arcsec 1.0 --maximum-separation-arcsec 0.3 \
         --guess-offset 1.0 --guess-pa 90.0 \
         --object-name wr124 --combo-prefix wr124-jwst-2022-f210m-TO-gaia
#+end_src

#+RESULTS:
: Statistics based on 404 coincident sources
: Mean displacement in RA: 1021.37 +/- 2.96 marcsec
: Mean displacement in Dec: -185.43 +/- 3.81 marcsec
: Median displacement in RA: 1022.15 +/- 0.83 marcsec
: Median displacement in Dec: -204.17 +/- 1.02 marcsec

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets.py wr124-jwst-2022-f210m-TO-gaia-OFFSETS.ecsv
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f210m-TO-gaia-OFFSETS.pdf]]

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets-corr.py wr124-jwst-2022-f210m-TO-gaia-OFFSETS.ecsv --alpha 0.3
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f210m-TO-gaia-OFFSETS-CORR.pdf]]


****** NIRCAM f335m to GAIA
#+begin_src sh :dir data :results verbatim
  python ../scripts/find-offset.py \
         wr124-jwst-nircam-2022-f335m_BGSUB gaia \
         fwhm5.0-thresh30 wr124 \
         --minimum-radius-arcsec 1.0 --maximum-separation-arcsec 0.3 \
         --guess-offset 1.0 --guess-pa 90.0 \
         --object-name wr124 --combo-prefix wr124-jwst-2022-f335m-TO-gaia
#+end_src

#+RESULTS:
: Statistics based on 345 coincident sources
: Mean displacement in RA: 1023.05 +/- 0.97 marcsec
: Mean displacement in Dec: -159.17 +/- 2.13 marcsec
: Median displacement in RA: 1022.76 +/- 0.81 marcsec
: Median displacement in Dec: -162.58 +/- 1.00 marcsec


#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets.py wr124-jwst-2022-f335m-TO-gaia-OFFSETS.ecsv
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f335m-TO-gaia-OFFSETS.pdf]]

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets-corr.py wr124-jwst-2022-f335m-TO-gaia-OFFSETS.ecsv --alpha 0.3
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f335m-TO-gaia-OFFSETS-CORR.pdf]]


****** NIRCAM f444w to GAIA
#+begin_src sh :dir data :results verbatim
  python ../scripts/find-offset.py \
         wr124-jwst-nircam-2022-f444w_BGSUB gaia \
         fwhm5.0-thresh30 wr124 \
         --minimum-radius-arcsec 1.0 --maximum-separation-arcsec 0.3 \
         --guess-offset 1.0 --guess-pa 90.0 \
         --object-name wr124 --combo-prefix wr124-jwst-2022-f444w-TO-gaia
#+end_src

#+RESULTS:
: Statistics based on 353 coincident sources
: Mean displacement in RA: 1018.60 +/- 0.91 marcsec
: Mean displacement in Dec: -166.55 +/- 1.57 marcsec
: Median displacement in RA: 1018.37 +/- 0.83 marcsec
: Median displacement in Dec: -167.85 +/- 0.97 marcsec

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets.py wr124-jwst-2022-f444w-TO-gaia-OFFSETS.ecsv --max-sep 100
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f444w-TO-gaia-OFFSETS.pdf]]

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets-corr.py wr124-jwst-2022-f444w-TO-gaia-OFFSETS.ecsv --alpha 0.3
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f444w-TO-gaia-OFFSETS-CORR.pdf]]


****** NIRCAM f470n to GAIA
#+begin_src sh :dir data :results verbatim
  python ../scripts/find-offset.py \
         wr124-jwst-nircam-2022-f470n_BGSUB gaia \
         fwhm5.0-thresh30 wr124 \
         --minimum-radius-arcsec 1.0 --maximum-separation-arcsec 0.3 \
         --guess-offset 1.0 --guess-pa 90.0 \
         --object-name wr124 --combo-prefix wr124-jwst-2022-f470n-TO-gaia
#+end_src

#+RESULTS:
: Statistics based on 352 coincident sources
: Mean displacement in RA: 1024.28 +/- 1.25 marcsec
: Mean displacement in Dec: -153.83 +/- 1.83 marcsec
: Median displacement in RA: 1023.46 +/- 1.36 marcsec
: Median displacement in Dec: -153.83 +/- 1.62 marcsec


#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets.py wr124-jwst-2022-f470n-TO-gaia-OFFSETS.ecsv --max-sep 100
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f470n-TO-gaia-OFFSETS.pdf]]

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets-corr.py wr124-jwst-2022-f470n-TO-gaia-OFFSETS.ecsv --alpha 0.3
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f470n-TO-gaia-OFFSETS-CORR.pdf]]

This is the first one to show a scale as well as a rotation.  

****** MIRI f770w to GAIA

#+begin_src sh :dir data :results verbatim
  python ../scripts/find-offset.py \
         wr124-jwst-miri-2022-f770w_BGSUB gaia \
         fwhm5.0-thresh30 wr124 \
         --minimum-radius-arcsec 1.0 --maximum-separation-arcsec 0.3 \
         --guess-offset 0.0 --guess-pa 0.0 \
         --object-name wr124 --combo-prefix wr124-jwst-2022-f770w-TO-gaia
#+end_src

#+RESULTS:
: Statistics based on 73 coincident sources
: Mean displacement in RA: -21.87 +/- 2.04 marcsec
: Mean displacement in Dec: -164.40 +/- 5.73 marcsec
: Median displacement in RA: -22.98 +/- 1.83 marcsec
: Median displacement in Dec: -171.72 +/- 2.19 marcsec

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets.py wr124-jwst-2022-f770w-TO-gaia-OFFSETS.ecsv
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f770w-TO-gaia-OFFSETS.pdf]]

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets-corr.py wr124-jwst-2022-f770w-TO-gaia-OFFSETS.ecsv
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f770w-TO-gaia-OFFSETS-CORR.pdf]]

****** MIRI f1130w to GAIA

#+begin_src sh :dir data :results verbatim
  python ../scripts/find-offset.py \
         wr124-jwst-miri-2022-f1130w_BGSUB gaia \
         fwhm5.0-thresh30 wr124 \
         --minimum-radius-arcsec 1.0 --maximum-separation-arcsec 0.3 \
         --guess-offset 0.0 --guess-pa 0.0 \
         --object-name wr124 --combo-prefix wr124-jwst-2022-f1130w-TO-gaia
#+end_src

#+RESULTS:
: Statistics based on 26 coincident sources
: Mean displacement in RA: -13.80 +/- 9.89 marcsec
: Mean displacement in Dec: -148.69 +/- 12.14 marcsec
: Median displacement in RA: -23.48 +/- 5.43 marcsec
: Median displacement in Dec: -159.56 +/- 4.36 marcsec


#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets.py wr124-jwst-2022-f1130w-TO-gaia-OFFSETS.ecsv
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f1130w-TO-gaia-OFFSETS.pdf]]

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets-corr.py wr124-jwst-2022-f1130w-TO-gaia-OFFSETS.ecsv
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f1130w-TO-gaia-OFFSETS-CORR.pdf]]



****** MIRI f1280w to GAIA

#+begin_src sh :dir data :results verbatim
  python ../scripts/find-offset.py \
         wr124-jwst-miri-2022-f1280w_BGSUB gaia \
         fwhm5.0-thresh30 wr124 \
         --minimum-radius-arcsec 1.0 --maximum-separation-arcsec 0.3 \
         --guess-offset 0.0 --guess-pa 0.0 \
         --object-name wr124 --combo-prefix wr124-jwst-2022-f1280w-TO-gaia
#+end_src

#+RESULTS:
: Statistics based on 15 coincident sources
: Mean displacement in RA: -31.01 +/- 5.26 marcsec
: Mean displacement in Dec: -171.02 +/- 5.89 marcsec
: Median displacement in RA: -32.11 +/- 7.57 marcsec
: Median displacement in Dec: -172.41 +/- 7.16 marcsec


#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets.py wr124-jwst-2022-f1280w-TO-gaia-OFFSETS.ecsv
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f1280w-TO-gaia-OFFSETS.pdf]]

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets-corr.py wr124-jwst-2022-f1280w-TO-gaia-OFFSETS.ecsv
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f1280w-TO-gaia-OFFSETS-CORR.pdf]]


****** MIRI f1800w to GAIA

#+begin_src sh :dir data :results verbatim
  python ../scripts/find-offset.py \
         wr124-jwst-miri-2022-f1800w_BGSUB gaia \
         fwhm5.0-thresh30 wr124 \
         --minimum-radius-arcsec 1.0 --maximum-separation-arcsec 0.3 \
         --guess-offset 0.0 --guess-pa 0.0 \
         --object-name wr124 --combo-prefix wr124-jwst-2022-f1800w-TO-gaia
#+end_src

#+RESULTS:
: Statistics based on 8 coincident sources
: Mean displacement in RA: -12.12 +/- 12.13 marcsec
: Mean displacement in Dec: -151.68 +/- 6.52 marcsec
: Median displacement in RA: -14.95 +/- 15.55 marcsec
: Median displacement in Dec: -147.72 +/- 7.18 marcsec


#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets.py wr124-jwst-2022-f1800w-TO-gaia-OFFSETS.ecsv
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f1800w-TO-gaia-OFFSETS.pdf]]

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets-corr.py wr124-jwst-2022-f1800w-TO-gaia-OFFSETS.ecsv
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-jwst-2022-f1800w-TO-gaia-OFFSETS-CORR.pdf]]
***** Test the yaml numpy dump
#+begin_src sh :dir scripts :results verbatim
  python npyaml.py
#+end_src

#+RESULTS:
#+begin_example
ndarray:
- 1
- 2
- 3

scalar int ndarray: 1

scalar float ndarray: 1.0

np.int64: 1

np.float64: 1.0

#+end_example
***** DONE Details of the robust fits
CLOSED: [2023-09-27 Wed 19:30]
- I am using the default method to start with, which works well in most cases, but in the f150w filter it is too affected by outliers
- So I am going to try a weighting function that is more aggressive in winnowing the outliers
- Default weighting function is ~HuberT~, which has a very gentle fall off (1/x)
- These are called M-estimators and the best documentation is file:///Users/will/Library/Application%20Support/Dash/User%20Contributed/statsmodels/statsmodels%200.14.docset/Contents/Resources/Documents/examples/notebooks/generated/robust_models_1.html
- I will try with trimmed mean instead, which is the most drastic. Basically the same as sigma-clipping
  - I will use ~c = 3~, which is number of sigma to clip (where sigma is actually from MAD)
- This seems to work very well.  All the fits look more credible now. In all cases except f150w the changes were very small
- 
***** DONE Apply the correction terms
CLOSED: [2023-10-19 Thu 09:57]
- We now write out the offset and linear correction matrix to a yaml file
- We are getting inconsistent results from applying them though, which I need to investigate
  - [2023-10-13 Fri] I think I have found part of the problem at least. The reference pixel does not correspond to the central star, so any adjustment to the CD matrix will also produce a net shift
  - The other thing I want to do is to use only the rotation and scale components
- [2023-10-19 Thu] This now gives good enough results, so I will not attempt to refine it further
    
****** HST 1997 continuum to GAIA
First, just the offset
#+begin_src sh :dir data :results verbatim
    python ../scripts/apply-alignment.py \
           wr124-hst-1997-f675w \
           wr124-hst-1997-f675w-TO-gaia \
           --output-suffix SHIFT-GAIA \
           --offset-only
#+end_src

#+RESULTS:
: Offset: [  -8.08987622 -135.45859063] marcsec
: Scale: 1.000000, Rotation: 0.000000

Second, the full transform
#+begin_src sh :dir data :results verbatim
  python ../scripts/apply-alignment.py \
         wr124-hst-1997-f675w \
         wr124-hst-1997-f675w-TO-gaia \
         --output-suffix ALIGN-GAIA 
#+end_src

#+RESULTS:
: Offset: [  -8.08987622 -135.45859063] marcsec
: Rotation -0.000202 (significant at -3.159 sigma)
: Scale: 1.000000, Rotation: -0.000202

****** HST 1997 green continuum to Gaia
#+begin_src sh :dir data :results verbatim
  python ../scripts/apply-alignment.py \
         wr124-hst-1997-f555w \
         wr124-hst-1997-f555w-TO-gaia \
         --output-suffix ALIGN-GAIA 
#+end_src

#+RESULTS:
: Offset: [-15.3002092  -81.39261515] marcsec
: Rotation -0.000222 (significant at -1.506 sigma)
: Scale: 1.000000, Rotation: -0.000222

****** HST 1997 Ha to continuum
Shift only 
#+begin_src sh :dir data :results verbatim
  python ../scripts/apply-alignment.py \
         wr124-hst-1997-f656n \
         wr124-hst-1997-f656n-TO-f675w \
         --output-suffix SHIFT-f675w \
         --offset-only
#+end_src

#+RESULTS:
: Offset: [ 7.22065939 53.37060761] marcsec
: Scale: 1.000000, Rotation: 0.000000

Second, the full transform
#+begin_src sh :dir data :results verbatim
  python ../scripts/apply-alignment.py \
         wr124-hst-1997-f656n \
         wr124-hst-1997-f656n-TO-f675w \
         --output-suffix ALIGN-f675w 
#+end_src

#+RESULTS:
: Offset: [ 7.22065939 53.37060761] marcsec
: Scale 1.000214 (significant at 2.965 sigma)
: Scale: 1.000214, Rotation: 0.000000

****** HST 1997 green to red continuum
Shift only 
#+begin_src sh :dir data :results verbatim
  python ../scripts/apply-alignment.py \
         wr124-hst-1997-f555w \
         wr124-hst-1997-f555w-TO-f675w \
         --output-suffix SHIFT-f675w \
         --offset-only
#+end_src

#+RESULTS:
: Offset: [-12.55697143  57.66793642] marcsec
: Scale: 1.000000, Rotation: 0.000000

#+begin_src sh :dir data :results verbatim
  python ../scripts/apply-alignment.py \
         wr124-hst-1997-f555w \
         wr124-hst-1997-f555w-TO-f675w \
         --output-suffix ALIGN-f675w 
#+end_src

#+RESULTS:
: Offset: [-12.55697143  57.66793642] marcsec
: WARNING: On-axis shear -0.000042 (significant at -1.042 sigma)
: Scale: 1.000000, Rotation: 0.000000

****** HST 1997 Ha to GAIA
Shift only 
#+begin_src sh :dir data :results verbatim
  python ../scripts/apply-alignment.py \
         wr124-hst-1997-f656n \
         wr124-hst-1997-f656n-TO-gaia \
         --output-suffix SHIFT-GAIA \
         --offset-only
#+end_src

#+RESULTS:
: Offset: [ 11.5484252  -83.23478082] marcsec
: Scale: 1.000000, Rotation: 0.000000

Full transform
#+begin_src sh :dir data :results verbatim
  python ../scripts/apply-alignment.py \
         wr124-hst-1997-f656n \
         wr124-hst-1997-f656n-TO-gaia \
         --output-suffix ALIGN-GAIA 
#+end_src

#+RESULTS:
: Offset: [ 11.5484252  -83.23478082] marcsec
: Rotation -0.000312 (significant at -1.295 sigma)
: Scale: 1.000000, Rotation: -0.000312

****** HST 2008 Ha to GAIA
#+begin_src sh :dir data :results verbatim
  python ../scripts/apply-alignment.py \
         wr124-hst-2008-f656n \
         wr124-hst-2008-f656n-TO-gaia \
         --output-suffix SHIFT-GAIA \
         --offset-only
#+end_src

#+RESULTS:
: Offset: [ 16.21792661 -57.217935  ] marcsec
: Scale: 1.000000, Rotation: 0.000000

#+begin_src sh :dir data :results verbatim
  python ../scripts/apply-alignment.py \
         wr124-hst-2008-f656n \
         wr124-hst-2008-f656n-TO-gaia \
         --output-suffix ALIGN-GAIA 
#+end_src

#+RESULTS:
: Offset: [ 16.21792661 -57.217935  ] marcsec
: Rotation -0.000390 (significant at -2.977 sigma)
: Scale: 1.000000, Rotation: -0.000390

****** HST 2008 Ha to 1997 continuum
Shift only
#+begin_src sh :dir data :results verbatim
  python ../scripts/apply-alignment.py \
         wr124-hst-2008-f656n \
         wr124-hst-2008-f656n-TO-1997-f675w \
         --output-suffix SHIFT-1997-f675w \
         --offset-only
#+end_src

#+RESULTS:
: Offset: [ 9.60345428 77.42534219] marcsec
: Scale: 1.000000, Rotation: 0.000000

****** NIRCAM f090w to HST continuum
Shift only

#+begin_src sh :dir data :results verbatim
  python ../scripts/apply-alignment.py \
         wr124-jwst-nircam-2022-f090w \
         wr124-jwst-2022-f090w-TO-hst-1997-f675w \
         --output-suffix SHIFT-HST \
         --offset-only
#+end_src

#+RESULTS:
: Offset: [1030.29826074  -65.68302727] marcsec
: Scale: 1.000000, Rotation: 0.000000

Also scale and rotate
#+begin_src sh :dir data :results verbatim
  python ../scripts/apply-alignment.py \
         wr124-jwst-nircam-2022-f090w \
         wr124-jwst-2022-f090w-TO-hst-1997-f675w \
         --output-suffix ALIGN-HST 
#+end_src

#+RESULTS:
: Offset: [1030.29826074  -65.68302727] marcsec
: Scale: 1.000000, Rotation: 0.000000

****** NIRCAM to GAIA


#+begin_src sh :dir data :results verbatim
  python ../scripts/apply-alignment.py \
         wr124-jwst-nircam-2022-f090w \
         wr124-jwst-2022-f090w-TO-gaia \
         --output-suffix SHIFT-GAIA \
         --offset-only
#+end_src

#+RESULTS:
: Offset: [1024.71753151 -212.89214037] marcsec
: Scale: 1.000000, Rotation: 0.000000

Full transform
#+begin_src sh :dir data :results verbatim
  for F in f090w f150w f210m f335m f444w f470n; do
    echo "NIRCAM $F to GAIA"
    python ../scripts/apply-alignment.py \
           wr124-jwst-nircam-2022-$F \
           wr124-jwst-2022-$F-TO-gaia \
           --output-suffix ALIGN-GAIA
    echo
  done
#+end_src

#+RESULTS:
#+begin_example
NIRCAM f090w to GAIA
Offset: [1024.71753151 -212.89214037] marcsec
WARNING: Off-axis shear 0.000046 (significant at 1.238 sigma)
Rotation -0.000269 (significant at -7.321 sigma)
Scale: 1.000000, Rotation: -0.000269

NIRCAM f150w to GAIA
Offset: [1025.13267886 -205.03170231] marcsec
Rotation -0.000265 (significant at -6.584 sigma)
Scale: 1.000000, Rotation: -0.000265

NIRCAM f210m to GAIA
Offset: [1022.21858083 -206.1106554 ] marcsec
WARNING: Off-axis shear 0.000038 (significant at 1.771 sigma)
Rotation -0.000262 (significant at -12.311 sigma)
Scale 1.000053 (significant at 1.752 sigma)
Scale: 1.000053, Rotation: -0.000262

NIRCAM f335m to GAIA
Offset: [1022.70303814 -162.6647966 ] marcsec
WARNING: Off-axis shear 0.000027 (significant at 1.300 sigma)
Rotation -0.000294 (significant at -13.964 sigma)
Scale: 1.000000, Rotation: -0.000294

NIRCAM f444w to GAIA
Offset: [1018.61605194 -167.59920456] marcsec
WARNING: Off-axis shear 0.000028 (significant at 1.316 sigma)
Rotation -0.000313 (significant at -14.496 sigma)
Scale: 1.000000, Rotation: -0.000313

NIRCAM f470n to GAIA
Offset: [1024.1702356 -154.4711154] marcsec
Rotation -0.000299 (significant at -7.479 sigma)
Scale 1.000423 (significant at 12.992 sigma)
Scale: 1.000423, Rotation: -0.000299

#+end_example


****** MIRI to GAIA
#+begin_src sh :dir data :results verbatim
  for F in f770w f1130w f1280w f1800w; do
    echo "MIRI $F to GAIA"
    python ../scripts/apply-alignment.py \
           wr124-jwst-miri-2022-$F \
           wr124-jwst-2022-$F-TO-gaia \
           --output-suffix ALIGN-GAIA
    echo
  done
#+end_src

#+RESULTS:
#+begin_example
MIRI f770w to GAIA
Offset: [ -21.59359324 -170.80839271] marcsec
Rotation 0.000149 (significant at 2.346 sigma)
Scale 1.000093 (significant at 1.321 sigma)
Scale: 1.000093, Rotation: 0.000149

MIRI f1130w to GAIA
Offset: [ -22.73882763 -156.49597159] marcsec
WARNING: Off-axis shear -0.000275 (significant at -1.856 sigma)
Scale 0.999808 (significant at -1.158 sigma)
Scale: 0.999808, Rotation: 0.000000

MIRI f1280w to GAIA
Offset: [ -30.36850347 -170.03723244] marcsec
WARNING: Off-axis shear -0.000271 (significant at -1.344 sigma)
Scale 0.999719 (significant at -1.314 sigma)
Scale: 0.999719, Rotation: 0.000000

MIRI f1800w to GAIA
Offset: [ -13.75302628 -153.81436994] marcsec
Scale: 1.000000, Rotation: 0.000000

#+end_example

***** Test the results of applying the alignment
- We have corrected the WCS of different images to give alignment to the GAIA frame
- But when we look at these in DS9, they do no seem to be that well aligned with one another
- So I want a quantitative measure of the alignment
- We can re-run the ~plot-offsets.py~ and the ~plot-offsets-corr.py~ scripts for the relative displacements to see how well the images are aligned
  - But we need to have a list of point sources for the gaia-aligned image
  - However, the source lists are in pixel coordinates, so we can just reuse the original ones that we already did for each observation
  - We just need to make a symbolic link so that the program can find them


****** Test case: HST 1997 Ha and continuum
We do this first because it is using the CD matrix, which should be more straightforward

******* Summary of results
- The shift in DEC worked OK, but the RA shift seems to be overcompensated
  - Is this because of the cos delta term?
  - delta is 17 deg, so cos delta is 0.96, which should not make a big difference
  - It seems to be just due to inaccuracy in f656n-TO-gaia matching
- But the expansion/rotation has not
  - There was a slight expansion in the original f656n-to-f675w of about 2e-4
    - No significant rotation or skew
  - In the GAIA-aligned version it is still there with an additional on-axis skew
- Compare with the individual HST-to-GAIA alignments
  - [[id:F646740A-848E-4F5F-B333-5B931D06C3E4][HST f656n Ha first epoch to Gaia]]
  - [[id:CD08DF32-308B-4F9C-A6C5-A76C52482495][HST f675w continuum to GAIA]]
- Lesson seems to be that we should only use the best filter of a given camera for the GAIA matching
  - And other filters should be done relatively
  - Also, we should not construct the CD matrix directly, but rather extract a scale and rotation
  - And apply them only if they are significant
  - And the skew terms should never be applied (although reported if they seem significant)
    - One reason for this is that I suspect that DS9 does not use the skew terms in the WCS when displaying the image
- With the shifts only we get a good mutual alignment between f555w, f675w, and f656n
  - It eliminates rainbow patterns that we saw in RGB image without correction


******* Relative vs absolute alignments
- The relative alignment f656n-TO-f675w gives
  - offset, mas:
    + 7 +/- 2
    + 52 +/- 2
  - (1 - scale), ppm : 210 +/- 50
  - rotation, tan\theta, ppm: -30 +/- 65 so no significant rotation
  - on-axis skew, ppm: 80 +/- 50, marginally significant
  - off-axis skew, ppm: 50 +/- 65, not significant
- The absolute alignment f656n-TO-gaia gives
  - offset, mas:
    + 11 +/- 5
    + -83 +/- 8
  - (1 - scale), ppm : 180 +/- 180
  - rotation, tan\theta, ppm: -310 +/- 150
  - on-axis skew, ppm: -120 +/- 180
  - off-axis skew, ppm: 10 +/- 150, insignificant
- The absolute alignment f675w-TO-gaia gives
  - offset, mas:
    + -8 +/- 2
    + -135 +/- 2
  - (1 - scale), ppm : -9 +/- 50, insignificant
  - rotation, tan\theta, ppm: -202 +/- 40 
  - on-axis skew, ppm: 46 +/- 50, insignificant
  - off-axis skew, ppm: -59 +/- 65, insignificant


******** Accuracy of round tripping
- With the shifts only we have
  - Round trip shifts
     | From   | To     | RA        | Dec        |
     |--------+--------+-----------+------------|
     | f656n  | Gaia   | 11 +/- 5  | -83 +/- 8  |
     | f675w  | Gaia   | -8 +/- 2  | -135 +/- 2 |
     |--------+--------+-----------+------------|
     | f656n* | f675w* | 19 +/- 5. | 52 +/- 8.  |
     | f656n  | f675w  | 7 +/- 2   | 52 +/- 2   |
     |--------+--------+-----------+------------|
     | f656n  | f656n  | 12 +/- 5. | 0 +/- 8.   |
     #+TBLFM: @4$3..@4$4=@-2 - @-1 ;f0::@6$3..@6$4=@-2 - @-1 ;f0
  - Starred values are indirect via gaia: f656n -> gaia -> f675w
  - Final row is the round trip f656n -> gaia -> f675w -> f656n
  - We have a 2.5 sigma discrepancy in the RA

******* Symbolic links to give source lists for gaia-aligned images
#+begin_src sh :dir data :results verbatim
  ln -sf wr124-hst-1997-f656n_BGSUB-sources-fwhm2.0-thresh1.ecsv \
     wr124-hst-1997-f656n-ALIGN-GAIA-sources-LINK.ecsv
  ln -sf wr124-hst-1997-f675w_BGSUB-sources-fwhm2.0-thresh10.ecsv \
     wr124-hst-1997-f675w-ALIGN-GAIA-sources-LINK.ecsv
#+end_src

#+begin_src sh :dir data :results verbatim
  ln -sf wr124-hst-1997-f656n_BGSUB-sources-fwhm2.0-thresh1.ecsv \
     wr124-hst-1997-f656n-SHIFT-GAIA-sources-LINK.ecsv
  ln -sf wr124-hst-1997-f675w_BGSUB-sources-fwhm2.0-thresh10.ecsv \
     wr124-hst-1997-f675w-SHIFT-GAIA-sources-LINK.ecsv
#+end_src

#+RESULTS:

******* Re-run the relative offsets plots
Using the Gaia-aligned images
#+begin_src sh :dir data :results verbatim
  python ../scripts/find-offset.py \
         wr124-hst-1997-f656n-ALIGN-GAIA wr124-hst-1997-f675w-ALIGN-GAIA \
         LINK LINK \
         --minimum-radius-arcsec 1.0 --maximum-separation-arcsec 0.3 \
         --object-name wr124 --combo-prefix wr124-ALIGN-GAIA-hst-1997-f656n-TO-f675w
#+end_src

#+RESULTS:
: Statistics based on 43 coincident sources
: Mean displacement in RA: -12.15 +/- 2.38 marcsec
: Mean displacement in Dec: 1.08 +/- 2.60 marcsec
: Median displacement in RA: -12.61 +/- 2.41 marcsec
: Median displacement in Dec: 0.91 +/- 2.98 marcsec

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets.py wr124-ALIGN-GAIA-hst-1997-f656n-TO-f675w-OFFSETS.ecsv
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-ALIGN-GAIA-hst-1997-f656n-TO-f675w-OFFSETS.pdf]]

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets-corr.py wr124-ALIGN-GAIA-hst-1997-f656n-TO-f675w-OFFSETS.ecsv
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-ALIGN-GAIA-hst-1997-f656n-TO-f675w-OFFSETS-CORR.pdf]]

Repeat for the shift-only images

#+begin_src sh :dir data :results verbatim
  python ../scripts/find-offset.py \
         wr124-hst-1997-f656n-SHIFT-GAIA wr124-hst-1997-f675w-SHIFT-GAIA \
         LINK LINK \
         --minimum-radius-arcsec 1.0 --maximum-separation-arcsec 0.3 \
         --object-name wr124 --combo-prefix wr124-SHIFT-GAIA-hst-1997-f656n-TO-f675w
#+end_src

#+RESULTS:
: Statistics based on 43 coincident sources
: Mean displacement in RA: -11.85 +/- 2.29 marcsec
: Mean displacement in Dec: 1.23 +/- 2.47 marcsec
: Median displacement in RA: -11.29 +/- 2.55 marcsec
: Median displacement in Dec: 1.50 +/- 2.74 marcsec

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets.py wr124-SHIFT-GAIA-hst-1997-f656n-TO-f675w-OFFSETS.ecsv
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-SHIFT-GAIA-hst-1997-f656n-TO-f675w-OFFSETS.pdf]]

#+begin_src sh :dir data :results file
  python ../scripts/plot-offsets-corr.py wr124-SHIFT-GAIA-hst-1997-f656n-TO-f675w-OFFSETS.ecsv
#+end_src

#+RESULTS:
[[file:/Users/will/Dropbox/globule-seminario/m1-67/data/wr124-SHIFT-GAIA-hst-1997-f656n-TO-f675w-OFFSETS-CORR.pdf]]

***** Compare with Alejandro results
- CSV file with shifts from Alejandro
  - [[file:correction_coor_2.csv]]
***** Summary of shifts between images
- We will make a provisional table with all the shifts, plus comments on any patterns in the residuals
****** Relative shifts between adjacent images


|                | From   | To     | d RA              | d Dec           |    N |    pix | Comments                      |
|----------------+--------+--------+-------------------+-----------------+------+--------+-------------------------------|
| HST -> JWST    | f675w  | f090w  | -1036.43 +/- 1.92 | 76.99 +/- 2.70  |  246 | 100/31 |                               |
|----------------+--------+--------+-------------------+-----------------+------+--------+-------------------------------|
| NIRCAM short   | f090w  | f150w  | -0.38 +/- 0.16    | -3.99 +/- 0.16  |  409 |     31 |                               |
|                | f150w  | f210m  | 3.01 +/- 0.02     | -2.20 +/- 0.03  | 2143 |     31 | Linear contraction 30 ppm     |
| short -> long  | f210m  | f335m  | 0.51 +/- 0.13     | -43.65 +/- 0.09 |  838 |  31/63 | Expansion and rotation 70 ppm |
| NIRCAM long    | f335m  | f444w  | 3.78 +/- 0.08     | 5.22 +/- 0.06   |  466 |     63 | Rotation 30 ppm = 6 arcsec    |
|                | f444w  | f470n  | -6.57 +/- 0.87    | -12.74 +/- 1.04 |  391 |     63 | Strong contraction 400 ppm    |
|----------------+--------+--------+-------------------+-----------------+------+--------+-------------------------------|
| NIRCAM -> MIRI | f444w  | f770w  | 1042.42 +/- 4.65  | 1.62 +/- 3.96   |   42 | 63/111 | Rotation 500 ppm = 100 arcsec |
|----------------+--------+--------+-------------------+-----------------+------+--------+-------------------------------|
| MIRI           | f770w  | f1130w | -1.34 +/- 2.26    | -13.62 +/- 1.80 |   87 |    111 |                               |
|                | f1130w | f1280w | 1.97 +/- 5.84     | 12.66 +/- 6.91  |   92 |    111 | High dispersion at small r    |
|                | f1280w | f1800w | -5.01 +/- 6.39    | -15.72 +/- 6.82 |   96 |    111 | Ditto                         |
|----------------+--------+--------+-------------------+-----------------+------+--------+-------------------------------|
****** Absolute shifts to GAIA frame
All are to Gaia

|              | From   | d RA             | d Dec            |   N | pix | Comments |
|--------------+--------+------------------+------------------+-----+-----+----------|
| HST -> Gaia  | f675w  | -8.79 +/- 1.51   | -136.61 +/- 2.04 | 339 | 100 | rotation |
| 1997         | f656n  | 4.13 +/- 5.43    | -89.65 +/- 8.12  |  43 | 100 |          |
| 2008         | f656n  | 14.64 +/- 3.48   | -55.21 +/- 4.64  |  36 | 100 |          |
|--------------+--------+------------------+------------------+-----+-----+----------|
| NIRCAM short | f090w  | 1022.59 +/- 1.41 | -210.59 +/- 1.69 | 122 |  31 | rotation |
|              | f150w  | 1027.28 +/- 1.64 | -196.53 +/- 2.72 | 109 |  31 |          |
|              | f210m  | 1022.15 +/- 0.83 | -204.17 +/- 1.02 | 404 |  31 |          |
|--------------+--------+------------------+------------------+-----+-----+----------|
| NIRCAM long  | f335m  | 1022.76 +/- 0.81 | -162.58 +/- 1.00 | 345 |  63 |          |
|              | f444w  | 1018.37 +/- 0.83 | -167.85 +/- 0.97 | 353 |  63 |          |
|              | f470n  | 1023.46 +/- 1.36 | -153.83 +/- 1.62 | 352 |  63 |          |
|--------------+--------+------------------+------------------+-----+-----+----------|
| MIRI         | f770w  | -22.98 +/- 1.83  | -171.72 +/- 2.19 |  73 | 111 |          |
|              | f1130w | -23.48 +/- 5.43  | -159.56 +/- 4.36 |  26 | 111 |          |
|              | f1280w | -32.11 +/- 7.57  | -172.41 +/- 7.16 |  15 | 111 |          |
|              | f1800w | -14.95 +/- 15.55 | -147.72 +/- 7.18 |   8 | 111 |          |
|--------------+--------+------------------+------------------+-----+-----+----------|

***** Other work on JWST astrometry
- This is mainly by Johannes Sahlmann
****** Lessons learned from Sahlmann 2017 JWST-STScI-005492
- JWST TECHNICAL REPORT
- Astrometric accuracy of the JWST calibration field catalog examined with the first Gaia data release
- They are comparing HST-ACS and GAIA astrometry for the JWST calibration field in the LMC
- They fit highest degree d polynomials to the displacements
  - They describe these by the "mode" k = 2 (d + 1)
  - k = 2, d = 0 is a constant offset (2 parameters)
  - k = 4, d = 1 adds linear transformations: scale, rotation, and skew (6 additional parameters)
  - k = 6, d = 2 adds quadratic terms (12 additional parameters)
  - etc ...
- They find that they get "significant" improvement with k=8 (d=3) over k=6
  - However, this is just the statistical significance (p < 0.0027, which I think is 3 sigma)
  - It doesn't actually reduce the RMS of the residuals by very much over k=4 (from 1.835 mas to 1.778 mas in X, and from 2.513 mas to 2.369 mas in Y)
  - So, I think that *for our purposes we can stick with k=4 (linear transformations)* because we are not really interested in effects below 1 mas
  - Apparently the residual RMS is dominated by proper motions in this case, consistent with 50 km/s at distance of LMC over the 8.5 year baseline
- It turns out that the "HST convention" is that "distortions" are the corrections other than global offset, global rotation, and global scale (which it calls "calibrations")
  - So we will probably not need to bother with these /distortions/ unless a shear turns out to be important
  - But other conventions count the global scale as one of the "distortions"
- For their comparison, they find global scale and global rotation maximum offsets of order 5 mas, and skew maximum offsets of order 0.8 mas
- The linear terms can be decomposed into four components, which can be expressed in terms of the partial derivatives x_x, x_y, y_x, y_y (called b, c, d, e, f in the report)
  - global scale = sqrt(x_x y_y - x_y y_x)
  - global rotation: tan \theta = (x_y - y_x) / (x_x + y_y)
  - on-axis skew (different scales in X and Y) = 0.5 (x_x - y_y)
  - off-axis skew (non-perpendicularity of X and Y axes) = 0.5 (x_y + y_x)
- Note that these partial derivatives are of the "evaluation frame" coordinates with respect to the "reference frame" coordinates, which correspond to the second (TO) and first (FROM) image respectively in our case
  - So they are x_x = d x_2 / d x_1, x_y = d x_2 / d y_1, y_x = d y_2 / d x_1, y_y = d y_2 / d y_1
  - Our residual graphs are plotting
    - x_2 - x_1 versus x_1
    - x_2 - x_1 versus y_1, etc
  - So the slopes of our residual graphs are
    - D_xx = d x_2 / d x_1 - d x_1 / d x_1 = x_x - 1
    - D_xy = d x_2 / d y_1 - d x_1 / d y_1 = x_y (because x_1 and y_1 are independent)
    - D_yx = y_x
    - D_yy = y_y - 1
  - So we can put 
    - global scale: A = sqrt((D_xx + 1) (D_yy + 1) - D_xy D_yx)
      - Then to first order in D_xx, D_yy, D_xy, D_yx, we have ...
      - ... (A - 1) = 0.5 (D_xx + D_yy)
    - global rotation: tan \theta = (D_xy - D_yx) / (2 + D_xx + D_yy)
      - tan \theta = (D_xy - D_yx) / 2 A
      - First order ... tan \theta = 0.5 (D_xy - D_yx)
    - on-axis skew: B = 0.5 (D_xx - D_yy)
    - off-axis skew: C = 0.5 (D_xy + D_yx)
      
****** Follow-up report Sahlmann 2019 JWST-STScI-006828
- Does a similar study of HAWK-I catalog instead of HST-ACS
****** Third report Sahlmann 2020 JWST-STScI-007082
- Applies the same ideas to relative alignment between JWST instruments
- Uses FGS1, FGS2, and NIRISS (which are all parts of the same instrument)
- Finds lateral alignment offsets of 1 to 10 milliarcsec
- Finds orientation offsets of 3 to 6 arcsec (tan \theta less than 3e-5)
- Finds distortion terms (scale, skew) of order 1e-5
****** pystortion
- Abstract
  : pystortion provides support for distortion measurements in astronomical imagers. It includes classes to support fitting of bivariate polynomials of arbitrary degree and helper functions for crossmatching catalogs. The crossmatching uses an iterative approach in which a two-dimensional distortion model is fit at every iteration and used to continuously refine the position of extracted sources.
- https://ascl.net/2206.004
- https://github.com/spacetelescope/pystortion
- This includes a crossmatch module for matching sky catalogs
  - It is a bit more sophisticated than mine since it is iterative and uses the distortion model to refine the positions of the sources
- There is not really any documentation, but there are extensive tests, so it should be easy to work out how to use it

***** Find and apply scale and rotation calibrations
- We can fit straight lines to the residuals to get the first order derivatives
- Then we can directly map those onto the FITS PC matrix for the rotation and CDELT for the scale (or CD matrix for both)

 
** Reprojection and calculation of ratios
- [2023-10-19 Thu] We will reproject the images onto an orthogonal ra-dec grid, since that will make things easier for using matplotlib
- Initial approach is to take small groups of similar filters, as we did for the rgb images
-

  

*** Make a folder to hold them all
#+begin_src sh :dir data :results verbatim
  mkdir -vp reproject
#+end_src

#+RESULTS:
: reproject

*** Reproject NIRCAM images

Test with just f090w first
#+begin_src sh :dir data :results verbatim
  for F in f090w; do
    echo "NIRCAM $F reproject"
    time python ../scripts/reproject-radec.py \
           wr124-jwst-nircam-2022-$F-ALIGN-GAIA \
           reproject/wr124-jwst-nircam-2022-$F-radec \
           --pixel-scale-arcsec 0.031 \
           --angular-size-arcmin 2.5
    echo
  done
#+end_src

#+RESULTS:
: NIRCAM f090w reproject
: 

Then do the rest
#+begin_src sh :dir data :results verbatim
  for F in f150w f210m f335m f444w f470n; do
    echo "NIRCAM $F reproject"
    time python ../scripts/reproject-radec.py \
           wr124-jwst-nircam-2022-$F-ALIGN-GAIA \
           reproject/wr124-jwst-nircam-2022-$F-radec \
           --pixel-scale-arcsec 0.031 \
           --angular-size-arcmin 2.5
    echo
  done
#+end_src

#+RESULTS:
#+begin_example
NIRCAM f150w reproject

NIRCAM f210m reproject

NIRCAM f335m reproject

NIRCAM f444w reproject

NIRCAM f470n reproject

#+end_example

*** Reproject MIRI images
#+begin_src sh :dir data :results verbatim
  for F in f770w f1130w f1280w f1800w; do
    echo "MIRI $F reproject"
    time python ../scripts/reproject-radec.py \
           wr124-jwst-miri-2022-$F-ALIGN-GAIA \
           reproject/wr124-jwst-miri-2022-$F-radec \
           --pixel-scale-arcsec 0.031 \
           --angular-size-arcmin 2.5
    echo
  done
#+end_src

#+RESULTS:
: MIRI f770w reproject
: 
: MIRI f1130w reproject
: 
: MIRI f1280w reproject
: 
: MIRI f1800w reproject
: 

*** Reproject HST images
#+begin_src sh :dir data :results verbatim
  for F in 2008-f656n; do
    echo "HST $F reproject"
    time python ../scripts/reproject-radec.py \
           wr124-hst-$F-ALIGN-GAIA \
           reproject/wr124-hst-$F-radec \
           --pixel-scale-arcsec 0.031 \
           --angular-size-arcmin 2.5
    echo
  done
#+end_src

#+RESULTS:
: HST 2008-f656n reproject
: 

#+begin_src sh :dir data :results verbatim
  for F in 1997-f555w 1997-f675w 1997-f656n; do
    echo "HST $F reproject"
    time python ../scripts/reproject-radec.py \
           wr124-hst-$F-ALIGN-GAIA \
           reproject/wr124-hst-$F-radec \
           --pixel-scale-arcsec 0.031 \
           --angular-size-arcmin 2.5
    echo
  done
#+end_src

#+RESULTS:
: HST 1997-f555w reproject
: 
: HST 1997-f675w reproject
: 
: HST 1997-f656n reproject
: 

*** Ratio of NIRCAM images

#+begin_src sh :dir data/reproject :results silent
  python ../../scripts/find-ratio.py \
         wr124-jwst-nircam-2022-f470n-radec.fits \
         wr124-jwst-nircam-2022-f444w-radec.fits \
         ratio-f470n-f444w.fits \
         --bg-a 0.2 --bg-b 0.2
#+end_src

#+begin_src sh :dir data/reproject :results silent
  python ../../scripts/find-ratio.py \
         wr124-jwst-nircam-2022-f444w-radec.fits \
         wr124-jwst-nircam-2022-f335m-radec.fits \
         ratio-f444w-f335m.fits \
         --bg-a 0.2 --bg-b 0.18
#+end_src

#+begin_src sh :dir data/reproject :results silent
  python ../../scripts/find-ratio.py \
         wr124-jwst-nircam-2022-f335m-radec.fits \
         wr124-jwst-nircam-2022-f210m-radec.fits \
         ratio-f335m-f210m.fits \
         --bg-a 0.15 --bg-b 0.1
#+end_src

#+begin_src sh :dir data/reproject :results silent
  python ../../scripts/find-ratio.py \
         wr124-jwst-nircam-2022-f210m-radec.fits \
         wr124-jwst-nircam-2022-f150w-radec.fits \
         ratio-f210m-f150w.fits \
         --bg-a 0.1 --bg-b 0.22
#+end_src

#+begin_src sh :dir data/reproject :results silent
  python ../../scripts/find-ratio.py \
         wr124-jwst-nircam-2022-f150w-radec.fits \
         wr124-jwst-nircam-2022-f090w-radec.fits \
         ratio-f150w-f090w.fits \
         --bg-a 0.22 --bg-b 0.2
#+end_src

#+begin_src sh :dir data/reproject :results verbatim
  python ../../scripts/find-ratio.py --help
#+end_src

#+RESULTS:
#+begin_example
Usage: find-ratio.py [OPTIONS] FILE_A FILE_B OUTFILE

  Find the ratio A/B of two fits images after subtracting respective
  backgrounds

Arguments:
  FILE_A   [required]
  FILE_B   [required]
  OUTFILE  [required]

Options:
  --bg-a FLOAT          [default: 0]
  --bg-b FLOAT          [default: 0]
  --install-completion  Install completion for the current shell.
  --show-completion     Show completion for the current shell, to copy it or
                        customize the installation.

  --help                Show this message and exit.
#+end_example

*** Ratio of MIRI images
First do MIRI/NIRCAM
#+begin_src sh :dir data/reproject :results silent
  python ../../scripts/find-ratio.py \
         wr124-jwst-miri-2022-f770w-radec.fits \
         wr124-jwst-nircam-2022-f444w-radec.fits \
         ratio-f770w-f444w.fits \
         --bg-a 7.0 --bg-b 0.2
#+end_src
Then interband of MIRI
#+begin_src sh :dir data/reproject :results silent
  python ../../scripts/find-ratio.py \
         wr124-jwst-miri-2022-f1130w-radec.fits \
         wr124-jwst-miri-2022-f770w-radec.fits \
         ratio-f1130w-f770w.fits \
         --bg-a 23.0 --bg-b 7.0
#+end_src

#+begin_src sh :dir data/reproject :results silent
  python ../../scripts/find-ratio.py \
         wr124-jwst-miri-2022-f1280w-radec.fits \
         wr124-jwst-miri-2022-f1130w-radec.fits \
         ratio-f1280w-f1130w.fits \
         --bg-a 26.0 --bg-b 23.0
#+end_src
#+begin_src sh :dir data/reproject :results silent
  python ../../scripts/find-ratio.py \
         wr124-jwst-miri-2022-f1800w-radec.fits \
         wr124-jwst-miri-2022-f1280w-radec.fits \
         ratio-f1800w-f1280w.fits \
         --bg-a 95.0 --bg-b 26.0
#+end_src

*** Ratio of HST images

#+begin_src sh :dir data/reproject :results silent
  python ../../scripts/find-ratio.py \
         wr124-hst-2008-f656n-radec.fits \
         wr124-hst-1997-f656n-radec.fits \
         ratio-f656n-2008-1997.fits \
         --bg-a 0.0 --bg-b 0.0
#+end_src

#+begin_src sh :dir data/reproject :results silent
  python ../../scripts/find-ratio.py \
         wr124-hst-1997-f675w-radec.fits \
         wr124-hst-1997-f656n-radec.fits \
         ratio-f675w-f656n.fits \
         --bg-a 0.0 --bg-b 0.0
#+end_src

#+begin_src sh :dir data/reproject :results silent
  python ../../scripts/find-ratio.py \
         wr124-hst-1997-f675w-radec.fits \
         wr124-hst-1997-f555w-radec.fits \
         ratio-f675w-f555w.fits \
         --bg-a 0.0 --bg-b 0.0
#+end_src


** hst images
- [[file:MAST_wr124.json]] has a list  of the files that I have downloaded
  - These are the Level 3 products from the HLA of the WFPC2 observations, plus the Level 2 products from the FOC in the UV
  - On my laptop I have put the data files in file:/Users/will/Work/WR124-HST/

*** Available datasets
- I have got some images from HLA in the following filters
  - F656N
    - Two epochs
  - F555W
  - F675W
- They are badly contaminated by CRs, and I am not sure if these are the best observations or not
- It seems like the second F656N image I have is much better
  - Yes, this is the second epoch 2008-06
  - [2023-05-05 Fri] I am now using this image to mark the globules ass DS9 regions
- I also have some FOC images in the NUV, which appear to show nothing but the star
- Now I am downloading the original HST datasets (not the HLA ones)
  - They have the c1f extension, which means they may not have been drizzled
** Papers
- [[https://ui.adsabs.harvard.edu/abs/1998Ap&SS.260..181G][Grosdidier et al (1998)]] First epoch HST images. Has some prescient comments:
  : We see many bright resolved knots of emission in the inner nebula, often surrounded by spherical, diffuse material (Fig. 2).
  So they seem to have notice the knots and the shocked shells.
- [[https://ui.adsabs.harvard.edu/abs/2001ApJ...562..753G][Grosdidier et al (2001)]] Analysis of same HST images, together with 
  CFHT spectra. They do lots of statistical analysis of structure functions and PDFs and try to relate it to turbulence. However, when they try and remove the stars from the HST image, they also remove the knots, which is not ideal.
- 
